{"title":"HPE 3PAR SSMC Operating System Security Technical Implementation Guide","description":"This Security Technical Implementation Guide is published as a tool to improve the security of Department of Defense (DOD) information systems. The requirements are derived from the National Institute of Standards and Technology (NIST) 800-53 and related documents. Comments or proposed revisions to this document should be sent via email to the following address: disa.stig_spt@mail.mil.","version":"2","releaseInfo":"Release: 1 Benchmark Date: 24 Jul 2024","rules":[{"id":"SV-255237r958586_rule","stigId":"V-255237","groupId":"V-255237","title":"DPMS Target HPE 3PAR SSMC OS","severity":"CAT II","description":"Display of a standardized and approved use notification before granting access to the publicly accessible operating system ensures privacy and security notification verbiage used is consistent with applicable federal laws, Executive Orders, directives, policies, regulations, standards, and guidance. System use notifications are required only for access via logon interfaces with human users and are not required when such human interfaces do not exist. The banner must be formatted in accordance with applicable DOD policy. Use the following verbiage for operating systems that can accommodate banners of 1300 characters: \"You are accessing a U.S. Government (USG) Information System (IS) that is provided for USG-authorized use only. By using this IS (which includes any device attached to this IS), you consent to the following conditions: -The USG routinely intercepts and monitors communications on this IS for purposes including, but not limited to, penetration testing, COMSEC monitoring, network operations and defense, personnel misconduct (PM), law enforcement (LE), and counterintelligence (CI) investigations. -At any time, the USG may inspect and seize data stored on this IS. -Communications using, or data stored on, this IS are not private, are subject to routine monitoring, interception, and search, and may be disclosed or used for any USG-authorized purpose. -This IS includes security measures (e.g., authentication and access controls) to protect USG interests--not for your personal benefit or privacy. -Notwithstanding the above, using this IS does not constitute consent to PM, LE or CI investigative searching or monitoring of the content of privileged communications, or work product, related to personal representation or services by attorneys, psychotherapists, or clergy, and their assistants. Such communications and work product are private and confidential. See User Agreement for details.\" Use the following verbiage for operating systems that have severe limitations on the number of characters that can be displayed in the banner: \"I've read & consent to terms in IS user agreem't.\"","fixText":"Configure SSMC to display the Standard Mandatory DOD Notice and Consent Banner before granting access to the system by following below steps: \n\n1. Log on to SSMC Web Administrator console GUI as \"ssmcadmin\".\n\n2. Navigate to Actions >> Preferences >> Application.\n\n3. Toggle the Login banner slider to \"Yes\" and enter the standard DOD banner message text (Only English is supported).\n\n4. Click \"OK\" to Save your changes.","checkText":"Verify that SSMC displays the Standard Mandatory DOD Notice and Consent Banner before granting access to the system by following below steps: \n\n1. Log on to SSMC Web Administrator console GUI as \"ssmcadmin\".\n\n2. Navigate to Actions >> Preferences >> Application.\n\n3. Check if the login banner slider is toggled to \"yes\" and the desired text in English is set in the textbox adjacent to the control.\n\nIf the custom banner text is not set to the Standard Mandatory DOD Notice and Consent Banner, this is a finding.","cciIds":["CCI-001384","CCI-001385","CCI-001386","CCI-001387","CCI-001388"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-255238r958390_rule","stigId":"V-255238","groupId":"V-255238","title":"DPMS Target HPE 3PAR SSMC OS","severity":"CAT II","description":"Display of a standardized and approved use notification before granting access to SSMC ensures privacy and security notification verbiage used is consistent with applicable federal laws, Executive Orders, directives, policies, regulations, standards, and guidance. System use notifications are required only for access via logon interfaces with human users and are not required when such human interfaces do not exist. The banner must be formatted in accordance with applicable DOD policy. Use the following verbiage for operating systems that can accommodate banners of 1300 characters: \"You are accessing a U.S. Government (USG) Information System (IS) that is provided for USG-authorized use only. By using this IS (which includes any device attached to this IS), you consent to the following conditions: -The USG routinely intercepts and monitors communications on this IS for purposes including, but not limited to, penetration testing, COMSEC monitoring, network operations and defense, personnel misconduct (PM), law enforcement (LE), and counterintelligence (CI) investigations. -At any time, the USG may inspect and seize data stored on this IS. -Communications using, or data stored on, this IS are not private, are subject to routine monitoring, interception, and search, and may be disclosed or used for any USG-authorized purpose. -This IS includes security measures (e.g., authentication and access controls) to protect USG interests--not for your personal benefit or privacy. -Notwithstanding the above, using this IS does not constitute consent to PM, LE or CI investigative searching or monitoring of the content of privileged communications, or work product, related to personal representation or services by attorneys, psychotherapists, or clergy, and their assistants. Such communications and work product are private and confidential. See User Agreement for details.\" Use the following verbiage for operating systems that have severe limitations on the number of characters that can be displayed in the banner: \"I've read & consent to terms in IS user agreem't.\"","fixText":"Configure SSMC to display the full text of the Standard Mandatory DOD Notice and Consent Banner before granting access to the system. \n\nLog on to SSMC admin console as ssmcadmin; navigate to Action >> Preferences. Enable custom banner slider switch and set the following as banner text:\n\n\"You are accessing a U.S. Government (USG) Information System (IS) that is provided for USG-authorized use only.\n\nBy using this IS (which includes any device attached to this IS), you consent to the following conditions:\n\n-The USG routinely intercepts and monitors communications on this IS for purposes including, but not limited to, penetration testing, COMSEC monitoring, network operations and defense, personnel misconduct (PM), law enforcement (LE), and counterintelligence (CI) investigations.\n\n-At any time, the USG may inspect and seize data stored on this IS.\n\n-Communications using, or data stored on, this IS are not private, are subject to routine monitoring, interception, and search, and may be disclosed or used for any USG-authorized purpose.\n\n-This IS includes security measures (e.g., authentication and access controls) to protect USG interests--not for your personal benefit or privacy.\n\n-Notwithstanding the above, using this IS does not constitute consent to PM, LE or CI investigative searching or monitoring of the content of privileged communications, or work product, related to personal representation or services by attorneys, psychotherapists, or clergy, and their assistants. Such communications and work product are private and confidential. See User Agreement for details.\"","checkText":"Verify that SSMC displays the full text of the Standard Mandatory DOD Notice and Consent Banner before granting access to the system. \n\n1. Access the SSMC web application by submitting the URL https://<ssmc_ip_or_fqdn>:8443/.\n\n2. Log on to SSMC admin console as ssmcadmin.\n\n3. Navigate to Action >> Preferences. Verify that the full text of the Standard Mandatory DOD Notice and consent banner is seen as stored against Custom Banner field.\n\nThe DOD Notice and consent banner message should read as follows in all of steps 1, 2 and 3 above: \n\"You are accessing a U.S. Government (USG) Information System (IS) that is provided for USG-authorized use only.\n\nBy using this IS (which includes any device attached to this IS), you consent to the following conditions:\n\n-The USG routinely intercepts and monitors communications on this IS for purposes including, but not limited to, penetration testing, COMSEC monitoring, network operations and defense, personnel misconduct (PM), law enforcement (LE), and counterintelligence (CI) investigations.\n\n-At any time, the USG may inspect and seize data stored on this IS.\n\n-Communications using, or data stored on, this IS are not private, are subject to routine monitoring, interception, and search, and may be disclosed or used for any USG-authorized purpose.\n\n-This IS includes security measures (e.g., authentication and access controls) to protect USG interests--not for your personal benefit or privacy.\n\n-Notwithstanding the above, using this IS does not constitute consent to PM, LE or CI investigative searching or monitoring of the content of privileged communications, or work product, related to personal representation or services by attorneys, psychotherapists, or clergy, and their assistants. Such communications and work product are private and confidential. See User Agreement for details.\"\n\nIf the full text of the Standard Mandatory DOD Notice and Consent Banner is not displayed, this is a finding.","cciIds":["CCI-000048"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-255239r958510_rule","stigId":"V-255239","groupId":"V-255239","title":"DPMS Target HPE 3PAR SSMC OS","severity":"CAT II","description":"If maintenance tools are used by unauthorized personnel, they may accidentally or intentionally damage or compromise the system. The act of managing systems and applications includes the ability to access sensitive application information, such as system configuration details, diagnostic information, user information, and potentially sensitive application data. Some maintenance and test tools are either standalone devices with their own operating systems or are applications bundled with an operating system. Nonlocal maintenance and diagnostic activities are those activities conducted by individuals communicating through a network, either an external network (e.g., the internet) or an internal network. Local maintenance and diagnostic activities are those activities carried out by individuals physically present at the information system or information system component and not communicating across a network connection. Typically, strong authentication requires authenticators that are resistant to replay attacks and employ multifactor authentication. Strong authenticators include, for example, PKI where certificates are stored on a token protected by a password, passphrase, or biometric. Satisfies: SRG-OS-000125-GPOS-00065, SRG-OS-000396-GPOS-00176, SRG-OS-000424-GPOS-00188, SRG-OS-000394-GPOS-00174, SRG-OS-000250-GPOS-00093, SRG-OS-000425-GPOS-00189, SRG-OS-000426-GPOS-00190, SRG-OS-000423-GPOS-00187","fixText":"Configure SSMC to use Strong SSH ciphers to protect the integrity of remote access sessions by doing the following:\n\n1. Log on to the SSMC administrator console as \"ssmcadmin\". Press \"X\" to escape to general bash shell.\n\n2. Execute the following command:\n\n$  sudo /ssmc/bin/config_security.sh -o cnsa_mode_appliance -a enable -f","checkText":"Verify that SSMC is configured to strong SSH ciphers to protect the integrity of remote access sessions by doing the following:\n\nLog on to SSMC appliance as ssmcadmin via SSH, press \"X\" to escape to general bash shell from the TUI menu, and issue the following command:\n\n$  sudo /ssmc/bin/config_security.sh -o cnsa_mode_appliance -a status\n\nIf the output does not read as \"Appliance CNSA mode is enabled\", this is a finding.","cciIds":["CCI-000877","CCI-001453","CCI-002418","CCI-002420","CCI-002421","CCI-002422","CCI-002450","CCI-003123"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-255240r991588_rule","stigId":"V-255240","groupId":"V-255240","title":"DPMS Target HPE 3PAR SSMC OS","severity":"CAT II","description":"Limiting the number of logon attempts over a certain time interval reduces the chances that an unauthorized user may gain access to an account.","fixText":"Configure SSMC to enforce a delay of at least four seconds between logon prompts following a failed logon attempt. To do so, perform the following steps.\n\n1. Log on to SSMC appliance as ssmcadmin. Press \"X\" to escape to general bash shell.\n\n2. Execute the following command:\n\n$ sudo /ssmc/bin/config_security.sh -o config_failedlogin_delay -a enable -f","checkText":"Verify that SSMC enforces a delay of at least four seconds between logon prompts following a failed logon attempt. To do so, perform the following steps.\n\n1. Log on to SSMC appliance as ssmcadmin. Press \"X\" to escape to general bash shell.\n\n2. Execute the following command:\n\n$ sudo /ssmc/bin/config_security.sh -o config_failedlogin_delay -a status\n\nFailed login delay is enabled\n\nIf the command output does not read \"Failed login delay is enabled\", this is a finding.","cciIds":["CCI-000366"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-255241r1015727_rule","stigId":"V-255241","groupId":"V-255241","title":"DPMS Target HPE 3PAR SSMC OS","severity":"CAT II","description":"The shorter the password, the lower the number of possible combinations that need to be tested before the password is compromised. Password complexity, or strength, is a measure of the effectiveness of a password in resisting attempts at guessing and brute-force attacks. Password length is one factor of several that helps to determine strength and how long it takes to crack a password. Use of more characters in a password helps to exponentially increase the time and/or resources required to compromise the password.","fixText":"To enable and enforce the 15-character minimum password length policy, do the following: \n\n1. Log on to SSMC appliance as ssmcadmin. Press \"X\" to escape to general bash shell.\n\n2. Execute the following command:\n\n$ sudo /ssmc/bin/config_security.sh -o long_password_policy -a enable -f\n\nNote: ssmcaudit user should be disabled before executing this fix procedure.","checkText":"To verify that the 15-character minimum password length policy is set, do the following: \n\n1. Log on to SSMC appliance as ssmcadmin. Press \"X\" to escape to shell.\n\n2. Execute the following command:\n\n$ sudo /ssmc/bin/config_security.sh -o long_password_policy -a status\nLong password policy is enabled\n\nIf the status does not read \"enabled\", this is a finding.","cciIds":["CCI-004066","CCI-000205"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-255242r958564_rule","stigId":"V-255242","groupId":"V-255242","title":"DPMS Target HPE 3PAR SSMC OS","severity":"CAT II","description":"Any operating system providing too much information in error messages risks compromising the data and security of the structure, and content of error messages needs to be carefully considered by the organization. Organizations carefully consider the structure/content of error messages. The extent to which information systems are able to identify and handle error conditions is guided by organizational policy and operational requirements. Information that could be exploited by adversaries includes, for example, erroneous logon attempts with passwords entered by mistake as the username, mission/business information that can be derived from (if not stated explicitly by) information recorded, and personal information, such as account numbers, social security numbers, and credit card numbers.","fixText":"To configure SSMC to prevent exfiltration of sensitive information, disable all management email notifications. Execute the following steps:\n\n1. Log on to SSMC appliance as ssmcadmin. Press \"X\" to escape to general bash shell.\n\n2. Edit /opt/hpe/ssmc/ssmcbase/resources/ssmc.properties using vi editor.\n\n3. Locate and uncomment the property \"ssmc.management.notification.disable=false\". Save and exit.\n\n4. Using TUI menu option 2, restart SSMC service.","checkText":"To verify that SSMC is configured to prevent exfiltration of sensitive information, do the following:\n\n1. Log on to SSMC appliance as ssmcadmin. Press \"X\" to escape to general bash shell.\n\n2. Execute the following command:\n\n$ grep ^ssmc.management.notification.disable /opt/hpe/ssmc/ssmcbase/resources/ssmc.properties\n\nssmc.management.notification.disable=false\n\nIf the command output does not print \"ssmc.management.notification.disable=false\", this is a finding.","cciIds":["CCI-001312"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-255243r991589_rule","stigId":"V-255243","groupId":"V-255243","title":"DPMS Target HPE 3PAR SSMC OS","severity":"CAT II","description":"Configuring the operating system to implement organization-wide security implementation guides and security checklists ensures compliance with federal standards and establishes a common security baseline across DOD that reflects the most restrictive security posture consistent with operational requirements. The ssmcadmin account is an emergency group account used to administer ssmc. This is a privileged account that can Log on to the SSMC appliance. The ssmcaudit account is a nonprivileged group user account that can be enabled/disabled by ssmcadmin for CVE scanning via TUI. This is the other group account that can log on to the appliance. By alerting to the use of ssmcadmin account, the information assurance team can mitigate the risks involved in using this group account. These alerts must be used to ensure that the use of this account is warranted and documented.","fixText":"Configure SSMC to offload logs to a SIEM that is set up to alert the ISSO or SA when the ssmcadmin account is accessed by performing the following:\n\n1. Implement SSMC-WS-010080 to establish offloading logs to a SIEM.\n\n2. Configure the SIEM to alert the ISSO or SA in the event that the ssmcadmin account is accessed.","checkText":"Verify that SSMC is configured to offload logs to a SIEM that is set up to alert the ISSO or SA when the ssmcadmin account is accessed by performing the following:\n\n1. Log on to SIEM where the logs are being offloaded.\n\n2. Log on to SSMC with the ssmcadmin account.\n\n3. Return to the SIEM to see that an alert has been generated based on the access of the ssmcadmin account.\n\nIf the SIEM does not generate an alert for the ISSO or SA, this is a finding.","cciIds":["CCI-002664"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-255244r1015728_rule","stigId":"V-255244","groupId":"V-255244","title":"DPMS Target HPE 3PAR SSMC OS","severity":"CAT II","description":"Inaccurate time stamps make it more difficult to correlate events and can lead to an inaccurate analysis. Determining the correct time a particular event occurred on a system is critical when conducting forensic analysis and investigating system events. Synchronizing internal information system clocks provides uniformity of time stamps for information systems with multiple system clocks and systems connected over a network. Organizations should consider setting time periods for different types of systems (e.g., financial, legal, or mission-critical systems). Organizations should also consider endpoints that may not have regular access to the authoritative time server (e.g., mobile, teleworking, and tactical endpoints). This requirement is related to the comparison done every 24 hours in SRG-OS-000355 because a comparison must be done in order to determine the time difference. Satisfies: SRG-OS-000356-GPOS-00144, SRG-OS-000355-GPOS-00143","fixText":"Configure SSMC to synchronize system clock to the authoritative time source by doing the following:\n\n1. Log on to SSMC appliance as ssmcadmin. Press \"X\" to escape to general bash shell.\n\n2. Edit /ssmc/conf/security_config.properties using vi editor and configure the IP address of one or more time servers with which the system clock needs to be synchronized via NTP. Save and exit.\n\n3. Execute the following command: \n\n$ sudo /ssmc/bin/config_security.sh -o configure_ntp -a set -f","checkText":"Verify SSMC synchronizes system clocks to the authoritative time source by performing the following: \n\n1. Log on to SSMC appliance as ssmcadmin. Press \"X\" to escape to general bash shell.\n\n2. Execute the following command:\n\n$ sudo /ssmc/bin/config_security.sh -o configure_ntp -a status\n\nNTP service is configured\n\nIf the NTP service is not configured, this is a finding.","cciIds":["CCI-004923","CCI-004926","CCI-001891","CCI-002046"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-255245r958448_rule","stigId":"V-255245","groupId":"V-255245","title":"DPMS Target HPE 3PAR SSMC OS","severity":"CAT II","description":"Without path validation, an informed trust decision by the relying party cannot be made when presented with any certificate not already explicitly trusted. A trust anchor is an authoritative entity represented via a public key and associated data. It is used in the context of public key infrastructures, X.509 digital certificates, and DNSSEC. When there is a chain of trust, usually the top entity to be trusted becomes the trust anchor; it can be, for example, a Certification Authority (CA). A certification path starts with the subject certificate and proceeds through a number of intermediate certificates up to a trusted root certificate, typically issued by a trusted CA. This requirement verifies that a certification path to an accepted trust anchor is used for certificate validation and that the path includes status information. Path validation is necessary for a relying party to make an informed trust decision when presented with any certificate not already explicitly trusted. Status information for certification paths includes certificate revocation lists or online certificate status protocol responses. Validation of the certificate status information is out of scope for this requirement.","fixText":"Configure SSMC to perform PKI-based authentication for remote syslog connectivity with \"x509/certvalid\" or \"x509/name\" setting for auth mode:\n\n1. Log on to SSMC appliance as ssmcadmin. Press \"X\" to escape to general bash shell.\n\n2. Use vi to edit and configure /ssmc/conf/security_config.properties file with values necessary to connect with a remote syslog server. \nssmc.rsyslog.server.host=<rsyslog_server>\nssmc.rsyslog.server.port=<rsyslog_port>\nssmc.rsyslog.server.protocol=tcp\nssmc.rsyslog.server.tls-enabled=1\nssmc.rsyslog.cert.caroot=<ca_root_cert_pem>\nssmc.rsyslog.cert.clientcert=<ssmc_client_cert_pem>\nssmc.rsyslog.cert.clientkey=<ssmc_client_key_pem>\nssmc.rsyslog.server.authMode=< x509/name | x509/certvalid >\nssmc.rsyslog.server.permittedPeers=<cn_of_rsyslog_server>\nssmc.rsyslog.server.device=<ens160|ens192|eth0|eth1>\nssmc.rsyslog.queue.maxdiskspace=6\n\nSave and exit.\n\n3. Execute the following to activate connection to remote syslog server:\n$ sudo /ssmc/bin/config_security.sh -o remote_syslog_server -a set -f","checkText":"Check that the remote syslog connection is configured to use \"x509/certvalid\" or \"x509/name\" as authentication mode:\n\n$ sudo /ssmc/bin/config_security.sh -o remote_syslog_appliance -a status | grep ssmc.rsyslog.server.authMode\n\nExpected:\nssmc.rsyslog.server.authMode=x509/name\nOR\nssmc.rsyslog.server.authMode=x509/certvalid\n\nIf the output does not match either of the expected strings, it is a finding.","cciIds":["CCI-000185"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-255246r958388_rule","stigId":"V-255246","groupId":"V-255246","title":"DPMS Target HPE 3PAR SSMC OS","severity":"CAT III","description":"By limiting the number of failed logon attempts, the risk of unauthorized system access via user password guessing, otherwise known as brute-force attacks, is reduced. Limits are imposed by locking the account.","fixText":"Configure SSMC to limit consecutive invalid logon attempts for ssmcaudit user to three times by executing the following command:\n\n$sudo /ssmc/bin/config_security.sh -o session_lock -a enable -f","checkText":"Check if SSMC is configured to limit consecutive invalid logon attempts for ssmcaudit user to three times by executing the following command:\n\n$ sudo /ssmc/bin/config_security.sh -o session_lock -a status\nSession lock is enabled\n\nIf the output of this command does not read \"Session lock is enabled\", this is a finding.","cciIds":["CCI-000044"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-255247r970703_rule","stigId":"V-255247","groupId":"V-255247","title":"DPMS Target HPE 3PAR SSMC OS","severity":"CAT II","description":"Terminating an idle session within a short time period reduces the window of opportunity for unauthorized personnel to take control of a management session enabled on the console or console port that has been left unattended. In addition, quickly terminating an idle session will also free up resources committed by the managed network element. Terminating network connections associated with communications sessions includes, for example, deallocating associated TCP/IP address/port pairs at the operating system level, and deallocating networking assignments at the application level if multiple application sessions are using a single operating system-level network connection. This does not mean that the operating system terminates all sessions or network access; it only ends the inactive session and releases the resources associated with that session. Satisfies: SRG-OS-000163-GPOS-00072, SRG-OS-000279-GPOS-00109","fixText":"Configure SSMC web server to close inactive sessions after 10 minutes by doing the following:\n\n1. Log on to the SSMC appliance as ssmcadmin. Press \"X\" to escape to general bash shell.\n\n2. Use vi to edit /opt/hpe/ssmc/ssmcbase/resources/ssmc.properties file.\n\n3. Uncomment and update server.session.timeout property to 10 minutes (default is 15). Save and exit.\n\n4. Type \"config_appliance\" to return to TUI. Restart (stop and start) SSMC services using TUI menu option 2.","checkText":"Verify that SSMC web server is configured to close inactive sessions after 10 minutes by doing the following:\n\n1. Log on to the SSMC appliance as ssmcadmin. Press \"X\" to escape to general bash shell.\n\n2. Execute the command:\n\n$ grep ^server.session.timeout /opt/hpe/ssmc/ssmcbase/resources/ssmc.properties\n\nserver.session.timeout=10\n\nIf the value is not set to 10 minutes, this is a finding.","cciIds":["CCI-001133","CCI-002361"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-255248r1015729_rule","stigId":"V-255248","groupId":"V-255248","title":"DPMS Target HPE 3PAR SSMC OS","severity":"CAT II","description":"Preventing nonprivileged users from executing privileged functions mitigates the risk that unauthorized individuals or processes may gain unnecessary access to information or privileges. Privileged functions include, for example, establishing accounts, performing system integrity checks, or administering cryptographic key management activities. Nonprivileged users are individuals that do not possess appropriate authorizations. Circumventing intrusion detection and prevention mechanisms or malicious code protection mechanisms are examples of privileged functions that require protection from nonprivileged users. Satisfies: SRG-OS-000324-GPOS-00125, SRG-OS-000373-GPOS-00157, SRG-OS-000373-GPOS-00158","fixText":"Configure SSMC to prevent nonprivileged users from executing privileged functions by doing the following:\n\n1. Log on to SSMC appliance as ssmcadmin. Press \"X\" to escape to general bash shell.\n\n2. Execute the following command:\n\n$ sudo /ssmc/bin/config_security.sh -o sudo_password -a enable","checkText":"Verify that SSMC prevents nonprivileged users from executing privileged functions by doing the following:\n\n1. Log on to SSMC appliance as ssmcadmin. Press \"X\" to escape to general bash shell.\n\n2. Execute the following commands:\n\n$ sudo /ssmc/bin/config_security.sh -o sudo_password -a status\n\nSudo password is enabled\n\nIf the command output does not read \"Sudo password is enabled\", this is a finding.","cciIds":["CCI-004895","CCI-002235","CCI-002038"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-255249r958442_rule","stigId":"V-255249","groupId":"V-255249","title":"DPMS Target HPE 3PAR SSMC OS","severity":"CAT III","description":"Without the capability to generate audit records, it would be difficult to establish, correlate, and investigate the events relating to an incident or identify those responsible for one. Audit records can be generated from various components within the information system (e.g., module or policy filter). The list of audited events is the set of events for which audits are to be generated. This set of events is typically a subset of the list of all events for which the system is capable of generating audit records. DOD has defined the list of events for which the operating system will provide an audit record generation capability as the following: 1. Successful and unsuccessful attempts to access, modify, or delete privileges, security objects, security levels, or categories of information (e.g., classification levels); 2. Access actions, such as successful and unsuccessful logon attempts, privileged activities or other system-level access, starting and ending time for user access to the system, concurrent logons from different workstations, successful and unsuccessful accesses to objects, all program initiations, and all direct access to the information system; 3. All account creations, modifications, disabling, and terminations; and 4. All kernel module load, unload, and restart actions. Satisfies: SRG-OS-000062-GPOS-00031, SRG-OS-000392-GPOS-00172","fixText":"Configure SSMC to provide audit record generation capability for DOD-defined auditable events for all operating system components by executing the following command:\n\n$ sudo /ssmc/bin/config_security.sh -o verbose_shell_session_logs -a enable -f","checkText":"Verify that SSMC provides audit record generation capability for DOD-defined auditable events for all operating system components, by executing the following command:\n\n$ sudo /ssmc/bin/config_security.sh -o verbose_shell_session_logs -a status\n\nVerbose shell session log is enabled\n\nIf the command outputs do not read as \"enabled\", this is a finding.","cciIds":["CCI-000169","CCI-002884"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-255250r958752_rule","stigId":"V-255250","groupId":"V-255250","title":"DPMS Target HPE 3PAR SSMC OS","severity":"CAT II","description":"In order to ensure operating systems have a sufficient storage capacity in which to write the audit logs, operating systems need to be able to allocate audit record storage capacity. The task of allocating audit record storage capacity is usually performed during initial installation of the operating system.","fixText":"Configure SSMC to allocate audit record storage capacity to store at least one week's worth of audit records. Perform the following to do so: \n\n1. Configure smtp parameters in /ssmc/conf/security_config.properties like below (use vi editor) -\n\nssmc.rsyslog.server.host=<rsyslog_server>\nssmc.rsyslog.server.port=<rsyslog_port>\nssmc.rsyslog.server.protocol=tcp\nssmc.rsyslog.server.tls-enabled=1\nssmc.rsyslog.cert.caroot=<ca_root_cert_pem>\nssmc.rsyslog.cert.clientcert=<ssmc_client_cert_pem>\nssmc.rsyslog.cert.clientkey=<ssmc_client_key_pem>\nssmc.rsyslog.server.authMode=<x509/name | x509/certvalid>\nssmc.rsyslog.server.permittedPeers=<cn_of_rsyslog_server>\nssmc.rsyslog.server.device=<ens160|ens192|eth0|eth1>\nssmc.rsyslog.queue.maxdiskspace=6\nssmc.rsyslog.smtp.alert=true\nssmc.rsyslog.smtp.server=<server_ip>\nssmc.rsyslog.smtp.port=25\nssmc.rsyslog.smtp.recipient=[\"id1@domain\",\"id2@domain\"]\nssmc.rsyslog.smtp.notify-interval=300\nssmc.rsyslog.smtp.mailFrom=id@domain\n\n2. Execute the following command to commit configuration and activate the service: \n\n$ sudo /ssmc/bin/config_security.sh -o remote_syslog_appliance -a set -f","checkText":"Verify SSMC allocates audit record storage capacity to store at least one weeks' worth of audit records, when audit records are not immediately sent to remote logging server by doing the following:\n\n1. Log on to SSMC appliance as ssmcadmin. Press \"X\" to escape to general bash shell.\n\n2. Execute the following command:\n\n$ sudo /ssmc/bin/config_security.sh -o remote_syslog_appliance -a status | grep ssmc.rsyslog.queue.maxdiskspace\n\nssmc.rsyslog.queue.maxdiskspace=6\n\nIf the command output does not read \"ssmc.rsyslog.queue.maxdiskspace=6\", this is a finding.","cciIds":["CCI-001849"],"status":"not_reviewed","findingDetails":"","comments":""}]}