{"title":"HPE Nimble Storage Array NDM Security Technical Implementation Guide","description":"This Security Technical Implementation Guide is published as a tool to improve the security of Department of Defense (DOD) information systems. The requirements are derived from the National Institute of Standards and Technology (NIST) 800-53 and related documents. Comments or proposed revisions to this document should be sent via email to the following address: disa.stig_spt@mail.mil.","version":"2","releaseInfo":"Release: 1 Benchmark Date: 24 Jul 2024","rules":[{"id":"SV-252186r960741_rule","stigId":"V-252186","groupId":"V-252186","title":"DPMS Target HPE Nimble Storage Array NDM","severity":"CAT II","description":"A session lock is a temporary network device or administrator-initiated action taken when the administrator stops work but does not log out of the network device. Rather than relying on the user to manually lock their management session prior to vacating the vicinity, network devices need to be able to identify when a management session has idled and take action to initiate the session lock. Once invoked, the session lock must remain in place until the administrator reauthenticates. No other system activity aside from reauthentication must unlock the management session. Note that CCI-001133 requires that administrative network sessions be disconnected after 10 minutes of idle time. So this requirement may only apply to local administrative sessions.","fixText":"Type \"group --edit --inactivity_timeout 15\".","checkText":"Type \"group --info | grep inactivity\" and review the timeout value. If it is greater than 15 minutes, this is a finding.","cciIds":["CCI-000057"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-252187r960840_rule","stigId":"V-252187","groupId":"V-252187","title":"DPMS Target HPE Nimble Storage Array NDM","severity":"CAT II","description":"By limiting the number of failed login attempts, the risk of unauthorized system access via user password guessing, otherwise known as brute-forcing, is reduced.","fixText":"Type \"userpolicy --edit --allowed_attempts 2\".","checkText":"Type \"userpolicy --info\" and review output for line: \"Number of authentication attempts\". If the value is 2 or less, this is not a finding.","cciIds":["CCI-000044"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-252188r960843_rule","stigId":"V-252188","groupId":"V-252188","title":"DPMS Target HPE Nimble Storage Array NDM","severity":"CAT II","description":"Display of the DoD-approved use notification before granting access to the network device ensures privacy and security notification verbiage used is consistent with applicable federal laws, Executive Orders, directives, policies, regulations, standards, and guidance. System use notifications are required only for access via logon interfaces with human users.","fixText":"Type \"group --edit --login_banner\", and then copy-paste or type the required banner. Then, to display the banner before login, type \"group --edit --login_banner_after_auth no\".","checkText":"Attempt a login to NimOS by typing \"ssh username@array\", where username is a valid user, and array is an array DNS name. If the correct DoD banner is not displayed before a password prompt, this is a finding.","cciIds":["CCI-000048"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-252190r997770_rule","stigId":"V-252190","groupId":"V-252190","title":"DPMS Target HPE Nimble Storage Array NDM","severity":"CAT II","description":"Password complexity, or strength, is a measure of the effectiveness of a password in resisting attempts at guessing and brute-force attacks. Password length is one factor of several that helps to determine strength and how long it takes to crack a password. The shorter the password, the lower the number of possible combinations that need to be tested before the password is compromised. Use of more characters in a password helps to exponentially increase the time and/or resources required to compromise the password.","fixText":"Set minimum password length to 15 by typing \"userpolicy --edit --min_length 15\".","checkText":"Type \"userpolicy --info\" and review output for line: \"Minimum Length\".\n\nIf it is 15 or more, this is not a finding.","cciIds":["CCI-004066"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-252191r997772_rule","stigId":"V-252191","groupId":"V-252191","title":"DPMS Target HPE Nimble Storage Array NDM","severity":"CAT II","description":"Use of a complex passwords helps to increase the time and resources required to compromise the password. Password complexity, or strength, is a measure of the effectiveness of a password in resisting attempts at guessing and brute-force attacks. Password complexity is one factor of several that determine how long it takes to crack a password. The more complex the password is, the greater the number of possible combinations that need to be tested before the password is compromised. Multifactor authentication (MFA) is required for all administrative and user accounts on network devices, except for an account of last resort and (where applicable) a root account. Passwords should only be used when MFA using PKI is not available, and for the account of last resort and root account.","fixText":"Set minimum number of uppercase characters to 1 by typing \"userpolicy --edit --upper 1\".","checkText":"Type \"userpolicy --info\" and review output for line: \"Minimum Uppercase characters\".\n\nIf it is 1 or more, this is not a finding.","cciIds":["CCI-004066"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-252192r997774_rule","stigId":"V-252192","groupId":"V-252192","title":"DPMS Target HPE Nimble Storage Array NDM","severity":"CAT II","description":"Use of a complex password helps to increase the time and resources required to compromise the password. Password complexity, or strength, is a measure of the effectiveness of a password in resisting attempts at guessing and brute-force attacks. Password complexity is one factor of several that determine how long it takes to crack a password. The more complex the password, the greater the number of possible combinations that need to be tested before the password is compromised. Multifactor authentication (MFA) is required for all administrative and user accounts on network devices, except for an account of last resort and (where applicable) a root account. Passwords should only be used when MFA using PKI is not available, and for the account of last resort and root account.","fixText":"Set minimum number of lowercase characters to 1 by typing \"userpolicy --edit --lower 1\".","checkText":"Type \"userpolicy --info\" and review output for line: \"Minimum Lowercase characters\".\n\nIf it is 1 or more, this is not a finding.","cciIds":["CCI-004066"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-252193r997775_rule","stigId":"V-252193","groupId":"V-252193","title":"DPMS Target HPE Nimble Storage Array NDM","severity":"CAT II","description":"Use of a complex password helps to increase the time and resources required to compromise the password. Password complexity, or strength, is a measure of the effectiveness of a password in resisting attempts at guessing and brute-force attacks. Password complexity is one factor of several that determine how long it takes to crack a password. The more complex the password, the greater the number of possible combinations that need to be tested before the password is compromised. Multifactor authentication (MFA) is required for all administrative and user accounts on network devices, except for an account of last resort and (where applicable) a root account. Passwords should only be used when MFA using PKI is not available, and for the account of last resort and root account.","fixText":"Set minimum number of numeric characters to 1 by typing \"userpolicy --edit --digit 1\".","checkText":"Type \"userpolicy --info\" and review output for line: \"Minimum Digits\". If it is 1 or more, this is not a finding.","cciIds":["CCI-004066"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-252194r997777_rule","stigId":"V-252194","groupId":"V-252194","title":"DPMS Target HPE Nimble Storage Array NDM","severity":"CAT II","description":"Use of a complex password helps to increase the time and resources required to compromise the password. Password complexity, or strength, is a measure of the effectiveness of a password in resisting attempts at guessing and brute-force attacks. Password complexity is one factor of several that determine how long it takes to crack a password. The more complex the password, the greater the number of possible combinations that need to be tested before the password is compromised. Multifactor authentication (MFA) is required for all administrative and user accounts on network devices, except for an account of last resort and (where applicable) a root account. Passwords should only be used when MFA using PKI is not available, and for the account of last resort and root account.","fixText":"Set minimum number of special characters to 1 by typing \"userpolicy --edit --special 1\".","checkText":"Type \"userpolicy --info\" and review output for line: \"Minimum Special characters\". \n\nIf it is 1 or more, this is not a finding.","cciIds":["CCI-004066"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-252195r997779_rule","stigId":"V-252195","groupId":"V-252195","title":"DPMS Target HPE Nimble Storage Array NDM","severity":"CAT II","description":"If the application allows the user to consecutively reuse extensive portions of passwords, this increases the chances of password compromise by increasing the window of opportunity for attempts at guessing and brute-force attacks. The number of changed characters refers to the number of changes required with respect to the total number of positions in the current password. In other words, characters may be the same within the two passwords; however, the positions of the like characters must be different. Multifactor authentication (MFA) is required for all administrative and user accounts on network devices, except for an account of last resort and (where applicable) a root account. Passwords should only be used when MFA using PKI is not available, and for the account of last resort and root account.","fixText":"Set minimum number of characters changed from previous password to 8 by typing \"userpolicy --edit --previous_diff 8\".","checkText":"Type \"userpolicy --info\" and review output for line: \"Minimum number of characters change from previous password\". \n\nIf it is 8 or more, this is not a finding.","cciIds":["CCI-004066"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-252196r961068_rule","stigId":"V-252196","groupId":"V-252196","title":"DPMS Target HPE Nimble Storage Array NDM","severity":"CAT I","description":"Terminating an idle session within a short time period reduces the window of opportunity for unauthorized personnel to take control of a management session enabled on the console or console port that has been left unattended. In addition, quickly terminating an idle session will also free up resources committed by the managed network element. Terminating network connections associated with communications sessions includes, for example, de-allocating associated TCP/IP address/port pairs at the operating system level, or de-allocating networking assignments at the application level if multiple application sessions are using a single, operating system-level network connection. This does not mean that the device terminates all sessions or network access; it only ends the inactive session and releases the resources associated with that session.","fixText":"To set the inactivity timeout to 10 minutes, type \"group --edit --inactivity_timeout 10\".","checkText":"Type \"group --info | grep inactivity\" and review the timeout value. If it is greater than 10 minutes, this is a finding.","cciIds":["CCI-001133"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-252197r997780_rule","stigId":"V-252197","groupId":"V-252197","title":"DPMS Target HPE Nimble Storage Array NDM","severity":"CAT I","description":"Centralized management of authentication settings increases the security of remote and nonlocal access methods. This control is particularly important protection against the insider threat. With robust centralized management, audit records for administrator account access to the organization's network devices can be more readily analyzed for trends and anomalies. The alternative method of defining administrator accounts on each device exposes the device configuration to remote access authentication attacks and system administrators with multiple authenticators for each network device.","fixText":"To configure AD, run the following commands: \n\n\"userauth --join <domain> --domain_user administrator\" and enter the domain administrator password to join <domain>. \n\n\"userauth --list\" will show the domain and its status. \n\nTo create a mapping between an AD group and one of the four device RBAC roles, run the following command: \n\n\"userauth --add_group <domain_group> --domain <domain> --role {administrator|poweruser|operator|guest}\"\n\nThis command allows any member of <domain_group> in <domain> AD domain to log in to the device with one of the selected roles. \n\nTo display the group to role mappings, run \"userauth --list_group --domain <domain>\".","checkText":"Run the command \"userauth --list\". \n\nIf the output is \"No domains configured\", this is a finding.","cciIds":["CCI-000366","CCI-000370"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-252198r1001013_rule","stigId":"V-252198","groupId":"V-252198","title":"DPMS Target HPE Nimble Storage Array NDM","severity":"CAT II","description":"For user certificates, each organization obtains certificates from an approved, shared service provider, as required by OMB policy. For federal agencies operating a legacy public key infrastructure cross-certified with the Federal Bridge Certification Authority at medium assurance or higher, this Certification Authority (CA) will suffice.","fixText":"To create and import a custom, CA-signed certificate, follow these steps:\n\n1. Type \"cert --gen custom-csr\". Copy the displayed CSR and submit it to an appropriate signing authority.\n2. Type \"cert --import custom-ca\" and paste the PEM-encoded CA certificate chain as input to the command.\n3. Type \"cert --import custom\" and paste the signed certificate obtained from the CA.","checkText":"Type \"cert --list\". Review the output to confirm that the custom-ca and custom certificates exist, and the \"Use\" values specified for HTTPS and APIS are both \"custom\". If not, this is a finding.","cciIds":["CCI-000366","CCI-001159","CCI-004068"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-252199r961863_rule","stigId":"V-252199","groupId":"V-252199","title":"DPMS Target HPE Nimble Storage Array NDM","severity":"CAT I","description":"Alerts are essential to let the system administrators and security personnel know immediately of issues which may impact the system or users. If these alerts are also sent to the syslog, this information is used to detect weaknesses in security that enable the network IA team to find and address these weaknesses before breaches can occur. Reviewing these logs, whether before or after a security breach, are important in showing whether someone is an internal employee or an outside threat. Alerts are identifiers about specific actions that occur on a group of arrays. There are several ways to meet this requirement. The Nimble can be configured for forward alerts from groups to a secure Simple Mail Transfer Protocol (SMTP) server. The alert may also be sent to the syslog server and the syslog configured to send the alert to the appropriate personnel.","fixText":"Configure email alerts (optional)\ngroup--edit [--smtp_serversmtp server] [--smtp_portsmtp port] [--smtp_auth {yes | no}] [--smtp_username username]\n--smtp_encrypt_type  ssl [--smtp_from_addr email addr] [--smtp_to_addr email addr]\n[--send_event_data {yes | no}] [--alert_level {info | warning | critical}]\n\nTo specify and enable logging of alerts, type \"group --edit --syslog_enabled yes --syslog_server <server> --syslog_port <port>\", where <server> and <port> are the server DNS name or IP address, and <port> is the port to send syslog messages to.","checkText":"Type \"group --info | grep -i syslog\" and review the output lines. The \"Syslogd enabled\" value should be \"Yes\", and the \"Syslogd server\" and \"Syslogd port\" values should contain the correct syslog server and port values. If not, this is a finding.","cciIds":["CCI-002605"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-252200r961863_rule","stigId":"V-252200","groupId":"V-252200","title":"DPMS Target HPE Nimble Storage Array NDM","severity":"CAT I","description":"Network devices running an unsupported operating system lack current security fixes required to mitigate the risks associated with recent vulnerabilities.","fixText":"To upgrade to a supported version, type \"software --list\". \r\n\r\nSelect the last version listed with at least number 5.2.x.\r\n\r\nType \"software --download <version<, where <version< is the version selected. \r\n\r\nAfter the download is complete, type \"software --update\" and accept the terms and conditions.\r\n\r\nThe update progress can be monitored using \"software --update_status\". Once finished, use \"version\" to verify that the new software has been installed correctly.","checkText":"Log in to https://infosight.hpe.com using HPE Passport credentials.\r\n\r\nClick on the Main Menu icon in the upper left corner. Select Resources >> Alletra 6000, Nimble Storage >> Documentation.\r\n\r\nDetermine current array OS version using User Interface (UI).\r\n\r\nRefer to Nimble \"GUI Administration Guide\" Version: NOS 5.2.x, section \"Hardware and Software Updates\", subsection \"Find the Array OS Version\" to determine the version of the OS that is currently in use by the array.\r\n\r\nDetermine available array OS update versions using InfoSight.\r\n\r\n*Any version of Nimble OS software greater than the \"current array OS version\" might qualify to be an update to the \"current array OS version\". The option exists to bypass several releases to come up to the newest available release depending upon requirements.\r\n\r\n*Call HPE Support with any questions about choosing an appropriate release or the process to upgrade a release.\r\n\r\n- Follow above instructions to log in to HPE InfoSight.\r\n- Choose a \"Software Version\" from the left panel equal to or greater than the current array OS version. For example, 5.2.x would be equal to the current version and 5.3.x would be greater than the current version.\r\n- Open the Release Notes document for each version that is greater than the current array OS version. For example, \"NimbleOS Release Notes Version NOS 5.2.1.700\" is greater than NOS 5.2.1.600.\r\n- Review the entire release notes document.\r\n- Determine if this is a release should be used for an upgrade.\r\n- Confirm that the \"From Version\", for example 5.2.1.600, can be used to go to the version for which the release notes are applicable; for example 5.2.1.700.\r\n\r\nIf the operating system version is no longer supported by the vendor, this is a finding.","cciIds":["CCI-000366"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-252201r960735_rule","stigId":"V-252201","groupId":"V-252201","title":"DPMS Target HPE Nimble Storage Array NDM","severity":"CAT II","description":"Device management includes the ability to control the number of administrators and management sessions that manage a device. Limiting the number of allowed administrators and sessions per administrator based on account type, role, or access type is helpful in limiting risks related to DoS attacks. This requirement addresses concurrent sessions for administrative accounts and does not address concurrent sessions by a single administrator via multiple administrative accounts. The maximum number of concurrent sessions should be defined based upon mission needs and the operational environment for each system. At a minimum, limits must be set for SSH, HTTPS, account of last resort, and root account sessions. The product contains the ability to limit the number of total sessions, but not by individual user or user type.","fixText":"On the Administration >> Security Policies page in the UI, uncheck \"Unlimited\" for the number of sessions and specify a new limit.","checkText":"Verify that in Administration >> Security Policies page in the UI, \"Unlimited\" for the number of sessions is unchecked and a limit is specified.\n\nIf a limit is not specified, this is a finding.","cciIds":["CCI-000054"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-252202r1001011_rule","stigId":"V-252202","groupId":"V-252202","title":"DPMS Target HPE Nimble Storage Array NDM","severity":"CAT II","description":"The loss of connectivity to a particular authoritative time source will result in the loss of time synchronization (free-run mode) and increasingly inaccurate time stamps on audit events and other functions. Multiple time sources provide redundancy by including a secondary source. Time synchronization is usually a hierarchy; clients synchronize time to a local source while that source synchronizes its time to a more accurate source. The network device must utilize an authoritative time server and/or be configured to use redundant authoritative time sources. This requirement is related to the comparison done in CCI-001891. DOD-approved solutions consist of a combination of a primary and secondary time source using a combination or multiple instances of the following: a time server designated for the appropriate DOD network (NIPRNet/SIPRNet); United States Naval Observatory (USNO) time servers; and/or the Global Positioning System (GPS). The secondary time source must be located in a different geographic region than the primary time source.","fixText":"Configure the HPE Nimble Array to synchronize internal information system clocks with the primary time source:\n \nArrayA:/# group --edit --ntpserver <ip_address_of_ntp_server>\n  \nThere would be a finding here given we only support primary ntp source.","checkText":"To Determine if the HPE Nimble Array is configured to synchronize internal information system clocks with the primary NTP server:\n \nArrayA:/# ntpq\nntpq> sysinfo\nassocid=0 status=0615 leap_none, sync_ntp, 1 event, clock_sync,\nsystem peer: cxo-nmbldc-01.nimblestorage.com:123\nsystem peer mode: client\nleap indicator: 00\nstratum: 4\nlog2 precision: -24\nroot delay: 37.321\nroot dispersion: 265.639\nreference ID: 10.157.24.95\nreference time: e509b178.9f897118 Thu, Oct 7 2021 11:48:40.623\nsystem jitter: 0.000000\nclock jitter: 0.673\nclock wander: 0.003\nbroadcast delay: -50.000\nsymm. auth. delay: 0.000\n\nIf the HPE Storage Array is not configured to synchronize internal information system clocks with the primary and secondary time sources located in different geographic regions using redundant authoritative time sources, this is a finding.","cciIds":["CCI-000366","CCI-004928","CCI-004922"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-252203r961860_rule","stigId":"V-252203","groupId":"V-252203","title":"DPMS Target HPE Nimble Storage Array NDM","severity":"CAT II","description":"Information stored in one location is vulnerable to accidental or incidental deletion or alteration. UDP is used to communicate between the array group and the syslog server (SSL is not supported at this time). This is an issue because DoD requires the use of TCP. One syslog message is generated for each alert and audit log message. Alert severity types include INFO, WARN, and ERROR.","fixText":"To specify and enable logging of alerts, type \"group --edit --syslog_enabled yes --syslog_server <server> --syslog_port <port>\", where <server> and <port> are the server DNS name or IP address, and <port> is the port to send syslog messages to.","checkText":"Type \"group --info | grep -i syslog\" and review the output lines. The \"Syslogd enabled\" value should be \"Yes\", and the \"Syslogd server\" and \"Syslogd port\" values should contain the correct syslog server and port values. If not, this is a finding.","cciIds":["CCI-001851"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-252902r960966_rule","stigId":"V-252902","groupId":"V-252902","title":"DPMS Target HPE Nimble Storage Array NDM","severity":"CAT II","description":"DoD requires that the Mission Owner uses only the cloud services offering listed in either the FedRAMP or DISA PA DoD Cloud Catalog to host Unclassified, public-releasable, DoD information. HPE InfoSight data collection is disabled by default in the HPE Nimble. Users must not enable it.","fixText":"In HPE Nimble Storage arrays, data collection is disabled by default.\n\nNavigate to Administration >> Alerts and Monitoring page of the storage array management interface. \n\nUncheck the checkbox.","checkText":"Navigate to Administration >> Alerts and Monitoring page of the storage array management interface. Verify the checkbox is not checked.\n\nIf HPE InfoSight is enabled, this is a finding.","cciIds":["CCI-000382"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-259800r960966_rule","stigId":"V-259800","groupId":"V-259800","title":"DPMS Target HPE Nimble Storage Array NDM","severity":"CAT II","description":"DOD requires that the Mission Owner uses only the cloud services offering listed in either the FedRAMP or DISA PA DOD Cloud Catalog to host Unclassified, public-releasable, DOD information. Management by \"HPE Greenlake: Data Services Cloud Console\" is disabled by default for HPE Nimble and must not be enabled.","fixText":"Disable cloud console\r\nNavigate to Administration >> Customization >> Data Services Cloud Console.\r\n\r\nUncheck \"Connect to Data Services Cloud Console\".","checkText":"Ensure cloud console is disabled.\r\nType \"group --info |grep -i \"cloud enabled\". \r\n\r\nIf the response is \"cloud enabled: Yes\", this is a finding.","cciIds":["CCI-000382"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-259801r960966_rule","stigId":"V-259801","groupId":"V-259801","title":"DPMS Target HPE Nimble Storage Array NDM","severity":"CAT II","description":"DOD requires that the Mission Owner uses only the cloud services offering listed in either the FedRAMP or DISA PA DOD Cloud Catalog to host Unclassified, public-releasable, DOD information. Management by \"HPE Greenlake: Data Services Cloud Console\" is enabled by default for HPE Alletra and must be disabled.","fixText":"Disable Alletra cloud console.\r\nType \"group --edit --cloud_management off\".\r\n\r\nIf the response is as follows, contact your HPE sales account team to request approval:\r\n\r\n\"ERROR: Failed to change system configuration. Updating cloud management is not permitted.\"","checkText":"Verify cloud console is disabled.\r\nType \"group --info |grep -i \"cloud enabled\". \r\n\r\nIf the response is \"cloud enabled: Yes\", this is a finding.","cciIds":["CCI-000382"],"status":"not_reviewed","findingDetails":"","comments":""}]}