{"title":"IBM zSecure Suite Security Technical Implementation Guide","description":"This Security Technical Implementation Guide is published as a tool to improve the security of Department of Defense (DOD) information systems. The requirements are derived from the National Institute of Standards and Technology (NIST) 800-53 and related documents. Comments or proposed revisions to this document should be sent via email to the following address: disa.stig_spt@mail.mil.","version":"1","releaseInfo":"Release: 3 Benchmark Date: 02 Apr 2025","rules":[{"id":"SV-259728r1050748_rule","stigId":"V-259728","groupId":"V-259728","title":"DPMS Target IBM zSecure Suite","severity":"CAT II","description":"If the zSecure application were to allow any user to make changes to software libraries, those changes might be implemented without undergoing the appropriate testing and approvals that are part of a robust change management process. This requirement applies to applications with software libraries that are accessible and configurable, as in the case of interpreted languages. Software libraries also include privileged programs that execute with escalated privileges. Only qualified and authorized individuals must be allowed to obtain access to information system components to initiate changes, including upgrades and modifications.","fixText":"Ensure ALTER access to zSecure installation data sets is restricted to systems programmers, and all failures and successful UPDATE and higher access is logged. \n\nREAD access can be permitted to auditors, security administrators (domain level and decentralized), batch jobs that perform ESM maintenance, and trusted STC users.\n\nThe installing systems programmer will identify and document the product data sets and categorize them according to who will require UPDATE and higher access and if required that all successful UPDATE and higher access is logged. The installing systems programmer will identify if any additional groups need READ access for specific zSecure installation data sets, and once documented will work with the information system security officer (ISSO) to ensure they are properly restricted to the ESM active on the system.\n\nThe following commands are provided as a RACF sample for implementing zSecure installation data set controls. Please convert these commands for any other ESM:\n\nad 'hlq.zsec.inst.dsn' uacc(none) owner(zSecure owner) -\naudit(success(update) failures(read)) \npe 'hlq.zsec.inst.dsn'  id(AUDTAUDT, SECAAUDT, SECBAUDT, SECDAUDT, TSTCAUDT) access(READ)  \npe  'hlq.zsec.inst.dsn'  id(SYSPAUDT) access(ALTER)","checkText":"Verify the accesses to zSecure installation data sets are properly restricted. \n\n- The RACF profile(s) protecting zSecure installation data sets must not allow general access by means of UACC, ID(*), WARNING, or global access.\n- The RACF profile(s) protecting zSecure installation data sets must restrict READ access to auditors, security administrators , decentralized security administrators, batch jobs that perform External Security Manager (ESM) maintenance, and trusted STC users.\n- The RACF profile(s) protecting zSecure installation data sets must restrict UPDATE and higher access to systems programmers. \n- All failures and successful UPDATE and higher access must be logged.\n\nIf all of the above restrictions are true, this is not a finding.","cciIds":["CCI-001499"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-259729r960960_rule","stigId":"V-259729","groupId":"V-259729","title":"DPMS Target IBM zSecure Suite","severity":"CAT II","description":"IBM Security zSecure STC have the ability to use privileged functions and/or have access to sensitive data. Failure to properly restrict access to these zSecure STC data sets could result in violating the integrity of the base product, which could compromise the operating system or sensitive data.","fixText":"Ensure that READ and higher access to zSecure STC data sets is restricted to authorized users, and all failures and successful UPDATE and higher access is logged. \nAppropriate access can be permitted to auditors, decentralized security administrators, security administrators, automated operation STCs/batch jobs, batch jobs performing ESM maintenance, trusted STC users and systems programmers. \n\nThe following commands are provided as a sample for implementing zSecure STC data set controls: \n\nad 'hlq.zsec.alert.ckfreeze' uacc(none) owner(zSecure owner) -\naudit(success(update) failures(read))\npe 'hlq.zsec.alert.ckfreeze' id(SYSPAUDT, TSTCAUDT) access(READ) \nad 'hlq.zsec.access.monitor.dsn' uacc(none) owner(zSecure owner) -\naudit(success(UPDATE) failures(READ))\npe 'hlq.zsec.access.monitor.dsn' id(AUDTAUDT, SECAAUDT, SECDAUDT, SECBAUDT) access(READ) \npe 'hlq.zsec.access.monitor.dsn' id(SECBAUDT, \naccess(UPDATE)\npe 'hlq.zsec.access.monitor.dsn' id(SYSPAUDT, TSTCAUDT) access(ALTER) \nrdef logstrm LSName uacc(none) owner(zSecure owner) - audit(success(UPDATE) failures(read))\npe LSName class(logstrm) id(AUDTAUDT, SECAAUDT, SECDAUDT) access(READ) \npe LSName class(logstrm) id(CKXLOG, SECBAUDT, AUTOAUDT, SYSPAUDT) access(ALTER) \nrdef facility IXLSTR. <modelstrname> uacc(none) owner(zSecure owner) - audit(success(UPDATE) failures(READ))\npe IXLSTR.<modelstrname> class(facility) id(SYSPAUDT, TSTCAUDT) access(ALTER)","checkText":"Verify that access to the zSecure STC data sets is properly restricted.\r\n\r\nIf the following guidance is true, this is not a finding.\r\n\r\n- The RACF profiles protecting zSecure STC data sets do not allow general access by means of UACC, ID(*), WARNING, or global access.\r\n- READ and higher access to zAlert CKFREEZE data sets is restricted to trusted STC users and systems programmers.\r\n- READ access to Access Monitor output data sets is restricted to auditors, decentralized security administrators, security administrators, automated operation STCs/batch jobs, batch jobs performing ESM maintenance, trusted STC users, and systems programmers.\r\n- UPDATE access to Access Monitor output data sets is restricted to automated operation STCs/batch jobs, batch jobs performing ESM maintenance, trusted STC users, and systems programmers.\r\n- CONTROL and higher access to Access Monitor output data sets is restricted to trusted STC users and systems programmers.\r\n- All failures and successful UPDATE and higher access to zSecure STC data sets is logged.\r\n\r\nDASD-only CKXLOG log stream resources in the LOGSTRM class:\r\n- READ is restricted to security administrators, auditors, batch jobs performing ESM maintenance\r\n- ALTER restricted to CKXLOG task, system programmers, and batch jobs performing ESM maintenance\r\n* For Coupling-Facility CKXLOG log streams, the above applies in addition to checking the IXLSTR.model_structure_name profiles in the FACILITY class:\r\n- UPDATE and higher trusted STC users, and systems programmers.","cciIds":["CCI-001499"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-259730r1050750_rule","stigId":"V-259730","groupId":"V-259730","title":"DPMS Target IBM zSecure Suite","severity":"CAT II","description":"If zSecure were to allow inappropriate reading or updating of user data sets, sensitive information could be disclosed, or changes might result in incorrect results reported by the product. Only qualified and authorized individuals must be allowed to create, read, update, and delete zSecure user data sets.","fixText":"The following commands are provided as a RACF sample for implementing zSecure user data set controls. Convert these commands for any other ESM:\n\nad 'hlq.zsec.user.assert/ckfreeze/unload.dsn' uacc(none) owner(zSecure owner) - \naudit(success(update) failures(read))\n\npe 'hlq.zsec.user.assert/ckfreeze/unload.dsn' id(AUDTAUDT, AUTOAUDT, SECAAUDT, SECDAUDT, SECBAUDT, TSTCAUDT) access(READ)\n\npe 'hlq.zsec.user.assert/ckfreeze/unload.dsn' id(SECAAUDT, SECDAUDT, SECBAUDT, SYSPAUDT) access(ALTER) \n\nad 'hlq.zsec.accmon.user.dsn' uacc(none) owner(zSecure owner) -\naudit(success(update) failures(read))\n\npe 'hlq.zsec.accmon.user.dsn' id(AUDTAUDT, AUTOAUDT, SECAAUDT, SECDAUDT, SECBAUDT, TSTCAUDT) access(READ)\n\npe 'hlq.zsec.accmon.user.dsn' id(AUTOAUDT, SECBAUDT, TSTCAUDT, SYSPAUDT) access(ALTER)\nad ' hlq.zsec.user.ckcus*\naudit(success(UPDATE) failures(READ))\n\npe 'hlq.zsec.user.ckcus*' id(AUDTAUDT, AUTOAUDT, SECAAUDT, SECDAUDT, SECBAUDT, TSTCAUDT) access(UPDATE)\n\npe 'hlq.zsec.user.ckcus*' id(SYSPAUDT) access(ALTER) \nrdef logstrm LSName uacc(none) owner(zSecure owner) - \naudit(success(UPDATE) failures(read))\n\npe LSName class(logstrm) id(AUDTAUDT, AUTOAUDT, SECAAUDT, SECDAUDT, TSTCAUDT, SYSPAUDT) access(READ) \npe LSName class(logstrm) id(AUTOAUDT, TSTCAUDT, SYSPAUDT) access(ALTER)","checkText":"Verify the accesses to the zSecure user data sets are properly restricted. If the following guidance is true, this is not a finding. \n\n- The RACF profiles protecting zSecure user data sets do not allow general access by means of UACC, ID(*), WARNING, or global access.\n- READ access to ASSERTION, CKFREEZE, and UNLOAD data sets is restricted to auditors, automated operation STCs/batch jobs, decentralized security administrators, security administrators, batch jobs performing ESM maintenance, system programmers and trusted STC users.\n- UPDATE and higher access to ASSERTION, CKFREEZE, and UNLOAD data sets is restricted to decentralized security administrators, security administrators, batch jobs performing ESM maintenance, and system programmers. \n- All failures and successful UPDATE and higher access to ASSERTION, CKFREEZE, and UNLOAD data sets is logged. \n- READ access to Access Monitor output data sets is restricted to auditors, decentralized security administrators, security administrators, batch jobs performing ESM maintenance, automated operation STCs/batch jobs, and trusted STC users, and system programmers. \n- UPDATE and higher access to the Access Monitor output data sets is restricted to automated operation STCs/batch jobs, batch jobs performing ESM maintenance, trusted STC users, and system programmers. \n- All failed and all successful UPDATE and higher access to Access Monitor output data sets is logged.\n- READ access to CKACUST and CKACUSV data sets is restricted to auditors, batch jobs that perform ESM maintenance, decentralized security administrators, security administrators, automated operation STCs/batch jobs, trusted STC users, and systems programmers.\n- UPDATE access to CKACUST and CKACUSV data sets is restricted to decentralized security administrators, security administrators, automated operation STCs/batch jobs, batch jobs performing ESM maintenance, trusted STC users, and systems programmers.\n- CONTROL and higher access to CKACUST and CKACUSV data sets is restricted to systems programmers.\n- All failed and all successful UPDATE and higher access to CKACUST and CKACUSV data sets is logged.\n- READ access to CKXLOG log stream is restricted to auditors, decentralized security administrators, security administrators, automated operation STCs/batch jobs, trusted STC users, and system programmers.\n- UPDATE and higher access to CKXLOG log stream is restricted to automated operation STCs/batch jobs, trusted STC users, and system programmers.\n- All failed access to CKXLOG log stream is logged.","cciIds":["CCI-001499"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-259731r1051324_rule","stigId":"V-259731","groupId":"V-259731","title":"DPMS Target IBM zSecure Suite","severity":"CAT II","description":"Started tasks and batch job IDs can be automatically revoked accidentally if not properly protected. When properly protected STCs prevent any attempts to log on with a password, it eliminates the possibility of revocation due to excessive invalid password attempts (denial of service).","fixText":"Ensure user IDs assigned to zSecure started tasks and scheduled batch jobs are assigned the PROTECTED attribute and/or defined as an STC.\r\n\r\nThe following command is provided as a sample for adding the PROTECTED attribute. Convert this command for any other ESM:\r\n\r\n- ALTUSER <stuser> NOPASSWORD NOPHRASE\r\n- ALTUSER <batch user ID> NOPASSWORD NOPHRASE","checkText":"If user IDs assigned to zSecure started tasks and scheduled batch jobs are not assigned the PROTECTED attribute and/or defined as an STC, this is a finding.\n\nThe default zSecure STC names (that may be changed by installation) are as follows:\n\n- STC C2PACMON runs program C2PACMON.\n- STC C2POLICE runs program C2POLICE.\n- STC C2PCOLL runs program CKFCOLL. (CKFCOLL is also run as a step in batch jobs.)\n- STC C2RSERVE runs program BPXBATCH.\n- STC CKCS1154 runs program CKCS1154.\n- STC CKNSERVE runs program CKNSERVE.\n- STC CKCCEF runs program CKRCARLX.\n- STC CKQCLEEF runs program CKRCARLX.\n- STC CKQEXSMF runs program CKQEXSMF.\n- STC CKQRADAR runs program CKRCARLA.\n- STC CKXLOG runs program CKXLOG.\n\nVerify the naming conventions for the zSecure STCs and batch jobs with the responsible systems programmers.\n\nCheck which user IDs are assigned in the STDATA segment of the zSecure STCs. For these user IDs, verify they are assigned the PROTECTED attribute.","cciIds":["CCI-000764"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-259732r961095_rule","stigId":"V-259732","groupId":"V-259732","title":"DPMS Target IBM zSecure Suite","severity":"CAT II","description":"Functional access (which is controlled with access to XFACILIT profiles) must not commingle multiple functions under a single resource profile.","fixText":"Ensure READ and higher access to zSecure program resources is restricted to the appropriate staff members.\r\n\r\nREAD and higher access can be given to security administrators, decentralized security administrators, security batch jobs that perform ESM maintenance, and trusted STC users.\r\n\r\nThe following commands are provided as a sample for implementing zSecure functional resource controls: \r\nrdef CKF.<focus> uacc(none) owner(zSecure owner)\r\npe CKF.<focus> class(XFACILIT) id(SECAAUDT, SECBAUDT, SECDAUDT, TSTCAUDT) access(READ) \r\nrdef xfacilit CKNADMIN.<type>.<node-name> uacc(none) owner(zSecure owner) \r\npe CKNADMIN.<type>.<node-name> class(xfacilit) id(SECAAUDT, SECBAUDT, SECDAUDT, TSTCAUDT) access(READ) \r\nrdef xfacilit CKNDSN.<dstype>.<node-name>.<systemname>.<type> uacc(none) owner(zSecure owner)\r\npe CKNDSN.<dstype>.<node-name>.<systemname>.<type> class(xfacilit) id(SECAAUDT, SECBAUDT, SECDAUDT, TSTCAUDT) access(READ) \r\nrdef xfacilit CKG.<type>.** uacc(none) owner(zSecure owner)\r\npe CKG.<type>.** class(xfacilit) id(SECAAUDT, SECBAUDT, SECDAUDT, TSTCAUD) access(READ)\r\nrdef xfacilit CKR.<type> uacc(none) owner(zSecure owner)\r\npe CKR.<type>.** class(xfacilit) id(SECAAUDT, SECBAUDT, SECDAUDT, TSTCAUD) access(READ) \r\nrdef xfacilit C2R.SERVER.ADMIN uacc(none) owner(zSecure owner) \r\n\r\npe C2R.SERVER.ADMIN class(xfacilit) id(SECAAUDT, SECBAUDT, TSTCAUD) access(READ) \r\nrdef xfacilit C2R.CLIENT.** uacc(none) owner(zSecure owner)\r\npe C2R.CLIENT.** class(xfacilit) id(SECAAUDT, SECBAUDT, TSTCAUD) access(READ) \r\nrdef xfacilit C2X.ICH* uacc(none) owner(zSecure owner)\r\npe C2X.ICH* class(xfacilit) id(AUTOAUDT, TSTCAUDT) access(UPDATE)","checkText":"If the profiles protecting zSecure program resources do not allow general access by means of  UACC, ID(*),WARNING, or global access, this is not a finding.\r\n\r\nReview profile(s) protecting CKF.** resources in XFACILIT class. \r\n\r\nIf READ and higher access to any other CKF.<focus> profiles is not restricted to security administrators, decentralized security administrators, security batch jobs performing External Security Manager (ESM) maintenance, and trusted STC users, this is a finding.\r\n\r\nReview profile(s) protecting CKN*.** resources in XFACILIT class. \r\n\r\nIf READ and higher access to any other CKNADMIN.**, and CKNDSN.**, profiles is not restricted to security administrators, decentralized security administrators, security batch jobs performing ESM maintenance, and trusted STC users, this is a finding.\r\n\r\nReview profile(s) protecting CKG.** resources in XFACILIT class.\r\n\r\nIf READ and higher access to any other CKG.CMD.**, CKG.RAC.**, CKG.SCHEDULE.**, CKG.SCP.**,  CKG.SCPASK.**,CKG.UCAT.**, or CKG.USRDATA.** profiles is not restricted to security administrators, decentralized security administrators, security batch jobs performing ESM maintenance, and trusted STC users, this is a finding.\r\n\r\nReview profile(s) protecting CKR.** resources in XFACILIT class. \r\n\r\nIf READ and higher access to any other CKR.ACTION.**, CKR.CKRCARLA.APF, CKR.CKXLOG.**, CKR.OPTION.**, or CKR.READALL profiles is not restricted to security administrators, decentralized security administrators, security batch jobs performing ESM maintenance, and trusted STC users, this is a finding.\r\n\r\nIf  zSecure is used, review profile(s) protecting C2R.** resources in XFACILIT class. \r\n\r\nIf READ and higher access to any other C2R.CLIENT.** or C2R.SERVER.ADMIN profiles is not restricted to security administrators, decentralized security administrators, security batch jobs performing ESM maintenance, and trusted STC users, this is a finding.\r\n\r\nReview profile(s) protecting C2X.** resources in XFACILIT class. \r\n\r\nIf UPDATE access to any other C2X.ICH* profile is not restricted to automated operation STCs/batch jobs or trusted STC users, this is a finding.\r\n\r\nIf all failures and successful UPDATE and higher access attempts are logged, this is not a finding.","cciIds":["CCI-001082"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-259733r1050755_rule","stigId":"V-259733","groupId":"V-259733","title":"DPMS Target IBM zSecure Suite","severity":"CAT II","description":"Preventing nonprivileged users from executing privileged zSecure functions mitigates the risk that unauthorized individuals or processes may gain unnecessary access to information or privileges. Privileged functions include, for example, running COLLECT jobs, generating audit reports, and adjusting RACF security settings. Nonprivileged users are individuals who do not possess appropriate authorizations. Circumventing intrusion detection and prevention mechanisms or malicious code protection mechanisms are examples of privileged functions that require protection from nonprivileged users.","fixText":"Ensure that the following high-level qualifier profiles are defined in the configured zSecure class, by default XFACILIT, with UACC (NONE) and not in WARNING mode: \nCKF.**\nCKN*.** \nCKG.**\nCKR.**\nC2R.** (if you use zSecure Visual)\nC2X.**\n\nA minimum of all failed access must be logged. \n\nThe following is an example of RACF commands. Convert these commands for any other ESM:\nrdef xfacilit CKF.** uacc(none) owner(zSecure owner)\nrdef xfacilit CKN*.** uacc(none) owner(zSecure owner)\nrdef xfacilit CKG.** uacc(none) owner(zSecure owner)\nrdef xfacilit CKR.** uacc(none) owner(zSecure owner)\nrdef xfacilit C2R.** uacc(none) owner(zSecure owner)\nrdef xfacilit C2X.** uacc(none) owner(zSecure owner)","checkText":"If READ access to zSecure functional resources is not restricted to privileged users, this is a finding.\nIf the following high-level qualifier profiles are defined in the configured zSecure class, by default XFACILIT, with UACC (NONE) and not in WARNING mode, this is not a finding.\n\nCKF.**\nCKN*.**\nCKG.**\nCKR.**\nC2R.** (if you use zSecure Visual) \nC2X.**\n\nIf a minimum of all failed access is logged, this is not a finding.","cciIds":["CCI-002235"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-259734r1050758_rule","stigId":"V-259734","groupId":"V-259734","title":"DPMS Target IBM zSecure Suite","severity":"CAT II","description":"Users authorized to use the zSecure program CKFCOLL can collect z/OS system information that is not accessible to regular users. Users authorized to use the zSecure program CKGRACF can change certain permitted RACF profile definitions that otherwise would not be allowed. Users authorized to use the zSecure program CKRCARLX can fake SMF records. Allowing inappropriate users to use the CKFCOLL, CKGRACF, and CKRCARLX programs could result in disclosure of z/OS installation and configuration information or inappropriate RACF profile or SMF record changes. Satisfies: SRG-APP-000342-MFP-000090,SRG-APP-000343-MFP-000091","fixText":"The following commands are provided as a sample for implementing RACF zSecure user data set controls. Convert these commands for any other ESM:\n\nrdef program CKFCOLL uacc(none) owner(zSecure owner) audit(all(read))\npe CKFCOLL class(program) id(AUDTAUDT, SECAAUDT, SECBAUDT,\nSECDAUDT, SYSPAUDT) access(READ)\nrdef program CKGRACF uacc(none) owner(zSecure owner) audit(all(read))\npe CKGRACF class(program) id(AUDTAUDT, SECAAUDT, SECBAUDT,\nSECDAUDT, SYSPAUDT) access(READ)\nrdef program CKRCARLX uacc(none) owner(zSecure owner) audit(all(read))\npe CKRCARLX class(program) id(AUDTAUDT, SECAAUDT, SECBAUDT,\nSECDAUDT, SYSPAUDT) access(READ)","checkText":"If this is not a RACF system, the presence of CKGRACF is not applicable.\n\nVerify the access and log settings of the profiles that protect the use of the CKFCOLL and CKGRACF programs and the APF-authorized version of the CKRCARLA program.\n\nIf the CKF.** and CKG.** profiles that protect the use of the CKFCOLL, CKGRACF, and CKRCARLA programs allow general access (UACC, ID(*), WARNING, or global access) or do not log successful READ access, this is a finding.\n\nIf READ or higher access to profile(s) protecting CKF.** resources in XFACILIT class is not restricted to security administrators (domain or decentralized), batch jobs performing ESM maintenance, auditors, or systems programmers, this is a finding.\n\nIf READ or higher access to profile(s) protecting CKG.** resources in XFACILIT class is not restricted to security administrators (domain or decentralized) or batch jobs performing ESM maintenance, this is a finding.\n\nReview auditing of the profile protecting the CKR.CKRCARLA.APF resource in XFACILIT class. \n\nIf successful READs are not audited, this is a finding.","cciIds":["CCI-002233","CCI-002234"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-259735r961458_rule","stigId":"V-259735","groupId":"V-259735","title":"DPMS Target IBM zSecure Suite","severity":"CAT II","description":"Unauthorized changes to the zSecure baseline configuration could make the system vulnerable to various attacks or allow unauthorized access to the system. Changes to information system configurations can have unintended side effects, some of which may be relevant to security. Detecting such changes and providing an automated response can help avoid unintended, negative consequences that could ultimately affect the security state of the application. Examples of security responses include but are not limited to the following: halting application processing, halting selected application functions, or issuing alerts/notifications to organizational personnel when there is an unauthorized modification of a configuration item.","fixText":"The recipients of the SMF reports or alert messages must investigate whether the UPDATE is legitimate (e.g., is documented and approved in a change management request). If it is not, they must restore the original configuration setting.","checkText":"Verify that a (daily) scheduled batch job is defined and used or a custom alert is configured and activated to inform appropriate personnel, such as auditors and compliance officers, about successful changes to the zSecure configuration data sets on their z/OS systems. \n\nIf SMF records regarding successful UPDATE(s) to zSecure configuration data sets are not reported to the information system security manager (ISSM), this is a finding.","cciIds":["CCI-001744"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-259736r961677_rule","stigId":"V-259736","groupId":"V-259736","title":"DPMS Target IBM zSecure Suite","severity":"CAT II","description":"Previous versions of zSecure products and components that are not removed from the information system after updates have been installed may be exploited by adversaries. Some information technology products may remove older versions of software automatically from the information system.","fixText":"Remove all upgraded/replaced software components that are no longer required for operation.","checkText":"Examine the inventory of installed software components for zSecure.\n\nIf software components that are no longer required for operation exist, this is a finding.","cciIds":["CCI-002617"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-259737r961683_rule","stigId":"V-259737","groupId":"V-259737","title":"DPMS Target IBM zSecure Suite","severity":"CAT II","description":"Security flaws with software applications are discovered daily. Vendors are constantly updating and patching their products to address newly discovered security vulnerabilities. Organizations (including any contractor to the organization) are required to promptly install security-relevant software updates (e.g., patches, service packs, and hot fixes). Flaws discovered during security assessments, continuous monitoring, incident response activities, or information system error handling must also be addressed expeditiously.","fixText":"Develop a procedure to install security-relevant software updates within the time period directed by an authoritative source (e.g., IAVMs, CTOs, DTMs, and STIGs).","checkText":"Ask the system administrator for the procedure to install security-relevant software updates within the time period directed by an authoritative source (e.g., IAVMs, CTOs, DTMs, and STIGs.\r\n\r\nIf there is no procedure, this a finding.","cciIds":["CCI-002605"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-259738r961863_rule","stigId":"V-259738","groupId":"V-259738","title":"DPMS Target IBM zSecure Suite","severity":"CAT II","description":"The zSecure resource class that is configured for the zSecure access checks must be active to receive valid Allow/Deny responses from external security manager (ESM) resource checks. Activation is outside of zSecure, in the ESM.","fixText":"Ensure the resource class that is configured in CKRSITE for zSecure security checks is active in the RACF class descriptor table. The default class is XFACILIT. IBM Security zSecure recommends the generic be activated.\n\nFollowing is a sample command:\n\nSETROPTS CLASSACT(XFACILIT) or SETROPTS CLASSACT(<configured resource class for access checks>)","checkText":"Run the CARLa command SHOW CKRSITE. The output of this command reveals which resource class is configured for handling the zSecure security checks. The default resource class is XFACILIT.\n\nVerify in the class descriptor table that the configured zSecure resource class is active. \n\nIf the configured zSecure resource class is not active, this is a finding.","cciIds":["CCI-000366"],"status":"not_reviewed","findingDetails":"","comments":""}]}