{"title":"IBM WebSphere Traditional V9.x Security Technical Implementation Guide","description":"This Security Technical Implementation Guide is published as a tool to improve the security of Department of Defense (DoD) information systems. The requirements are derived from the National Institute of Standards and Technology (NIST) 800-53 and related documents. Comments or proposed revisions to this document should be sent via email to the following address: disa.stig_spt@mail.mil.","version":"1","releaseInfo":"Release: 1 Benchmark Date: 23 Aug 2018","rules":[{"id":"SV-95907r1_rule","stigId":"V-81193","groupId":"V-81193","title":"DPMS Target WebSphere AS 9.x","severity":"CAT II","description":"Application management includes the ability to control the number of sessions that utilize an application by all accounts and/or account types. Limiting the number of allowed sessions is helpful in limiting risks related to Denial of Service attacks. Application servers host and expose business logic and application processes. The application server must possess the capability to limit the maximum number of concurrent sessions in a manner that affects the entire application server or on an individual application basis. Although there is some latitude concerning the settings themselves, the settings should follow DoD-recommended values, but the settings should be configurable to allow for future DoD direction. While the DoD will specify recommended values, the values can be adjusted to accommodate the operational requirement of a given system.","fixText":"In the administrative console page, click Servers >> Server Types >> WebSphere application servers >> [server_name] >> Session management.\r\n\r\nEdit the Maximum in-memory session count field to be the number of sessions allowable.","checkText":"Review system documentation.\r\n\r\nIdentify the application session requirements.\r\n\r\nIn the administrative console page, click Servers >> Server Types >> WebSphere application servers >> [server_name] >> Session management.\r\n\r\nEnsure the Maximum in-memory session count field is set to the number of sessions allowable.\r\n\r\nIf not set according to application requirements, this is a finding.","cciIds":["CCI-000054"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-95909r1_rule","stigId":"V-81195","groupId":"V-81195","title":"DPMS Target WebSphere AS 9.x","severity":"CAT II","description":"An attacker can take advantage of user sessions that are left open, thus bypassing the user authentication process. To thwart the vulnerability of open and unused user sessions, the application server must be configured to close the sessions when a configured condition or trigger event is met. Session termination terminates all processes associated with a user's logical session except those processes that are specifically created by the user (i.e., session owner) to continue after the session is terminated. Conditions or trigger events requiring automatic session termination can include, for example, periods of user inactivity, targeted responses to certain types of incidents, and time-of-day restrictions on information system use.","fixText":"Locate the deployment.xml file. The default file locations where deployment.xml is installed are provided below.  \r\n\r\nUNIX:\r\n/opt/IBM/WebSphere/Profiles/DefaultDmgr01/config/cells/<CELL NAME>/applications/isclite.ear/deployments/isclite/\r\n\r\nWindows:\r\nC:\\Program Files\\IBM\\WebSphere\\Profiles\\DefaultDmgr01\\config\\cells\\<CELL NAME>\\applications\\isclite.ear\\deployments\\isclite\\\r\n\r\nMake a backup copy of the deployment.xml file.\r\n\r\nEdit the deployment.xml file.\r\n\r\nModify the \"invalidationtimeout=\" value and set to \"10\".\r\n\r\nRestart the DMGR and all the JVMs.","checkText":"Review System Security Plan and system configuration documentation.\r\n\r\nAccess the Deployment Manager (DMGR) operating system.\r\n\r\nLocate the deployment.xml file. The default file location where deployment.xml is installed are provided below.  \r\n\r\nUNIX:\r\n/opt/IBM/WebSphere/Profiles/DefaultDmgr01/config/cells/<CELL NAME>/applications/isclite.ear/deployments/isclite/\r\n\r\nWindows:\r\nC:\\Program Files\\IBM\\WebSphere\\Profiles\\DefaultDmgr01\\config\\cells\\<CELL NAME>\\applications\\isclite.ear\\deployments\\isclite\\\r\n\r\nSearch the deployment.xml file for the string, \"invalidationtimeout=\"\r\n\r\nUNIX:\r\ngrep -i invalidationtimeout $PATH/deployment.xml\r\n\r\nWindows:\r\nfindstr -I invalidationtimeout= $PATH\\deployment.xml\r\n\r\nThe value is expressed in minutes and the default value is set to \"30 minutes\".  \r\n\r\nIf \"invalidationtimeout\" is not set to \"10 minutes\", this is a finding.","cciIds":["CCI-002361"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-95911r1_rule","stigId":"V-81197","groupId":"V-81197","title":"DPMS Target WebSphere AS 9.x","severity":"CAT II","description":"Without enabling repository checkpoints, you will not be able to determine the history of changes to WebSphere configuration files, and who made those changes.","fixText":"From administrative console click System administration >> Extended repository service >> Enable automatic repository checkpoints.\r\n\r\nEnter a \"checkpoint depth value\" according to the security plan.\r\n\r\nRestart the DMGR and all the JVMs.","checkText":"Review System Security Plan documentation.\r\n\r\nIdentify the required \"Automatic CheckPoint Depth\" setting that has been defined.\r\n\r\nFrom administrative console, click System administration >> Extended repository service.\r\n\r\nIf \"Enable automatic repository checkpoints\" is not selected or if the \"automatic checkpoint depth\" is less than the number of saves defined in the System Security Plan, this is a finding.","cciIds":["CCI-000067"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-95913r1_rule","stigId":"V-81199","groupId":"V-81199","title":"DPMS Target WebSphere AS 9.x","severity":"CAT I","description":"In previous releases of WebSphere® Application Server, when a user enabled global security, both administrative and application security were enabled. The previous notion of global security is split into administrative security and application security, each of which you can enable separately. As a result of this split, WebSphere Application Server clients must know whether application security is disabled at the target server. Administrative security is enabled, by default. Application security is disabled, by default. Before you can enable application security, you must verify that administrative security is enabled. Application security is in effect only when administrative security is enabled.","fixText":"From the administrative console, click Security >> Global Security.\r\n\r\nClick \"Enable administrative security\".\r\n\r\nClick \"Save\".\r\n\r\nRestart the DMGR and all the JVMs.","checkText":"From the administrative console, click Security >> Global Security.\r\n\r\nIf \"Enable administrative security\" is not selected, this is a finding.","cciIds":["CCI-002314"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-95915r1_rule","stigId":"V-81201","groupId":"V-81201","title":"DPMS Target WebSphere AS 9.x","severity":"CAT I","description":"A service integration bus is a group of one or more application servers or server clusters in a WebSphere® Application Server cell that cooperate to provide asynchronous messaging services. The application servers or server clusters in a bus are known as bus members. When a bus is created with bus security enabled, the following conditions apply: The bus requires client authentication. The bus enforces authorization policy. The bus requires use of SSL transport chains.","fixText":"From the administration console, navigate to Security >> Bus Security.\r\n\r\nFor each service integration bus where security is not enabled, click on \"Disabled\".\r\n\r\nClick the check box to \"Enable bus security\".\r\n\r\nConfigure the transport settings and authorization policies according to application security access requirements specified in the security plan.","checkText":"Review System Security Plan documentation.\r\n\r\nInterview the system administrator.\r\n\r\nIdentify the service integration buses configured on the WAS.\r\n\r\nIf there are no service integration buses, this requirement is NA.\r\n\r\nFrom the administration console, navigate to Security >> Bus Security.\r\n\r\nFor each service integration bus, if security is not enabled, this is a finding.","cciIds":["CCI-002315"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-95917r1_rule","stigId":"V-81203","groupId":"V-81203","title":"DPMS Target WebSphere AS 9.x","severity":"CAT II","description":"Security auditing will not be performed unless the audit security subsystem has been enabled. Global security must be enabled for the security audit subsystem to function, as no security auditing occurs if global security is not also enabled. Enable global security before enabling security auditing. Satisfies: SRG-APP-000016-AS-000013, SRG-APP-000343-AS-000030, SRG-APP-000080-AS-000045, SRG-APP-000092-AS-000053, SRG-APP-000266-AS-000168, SRG-APP-000267-AS-000170","fixText":"In the administrative console, navigate to Security >> Security auditing to enable.\r\n\r\nRestart the DMGR and all the JVMs.","checkText":"In the administrative console, navigate to Security >> Security auditing.\r\n\r\nIf \"Enable security auditing\" is not enabled, this is a finding.","cciIds":["CCI-000067","CCI-000166","CCI-001312","CCI-001314","CCI-001464","CCI-002234"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-95919r1_rule","stigId":"V-81205","groupId":"V-81205","title":"DPMS Target WebSphere AS 9.x","severity":"CAT II","description":"Logging must be utilized in order to track system activity, assist in diagnosing system issues, and provide evidence needed for forensic investigations post security incident. Remote access by administrators requires that the admin activity be logged. Application servers provide a web and command line-based remote management capability for managing the application server. Application servers must ensure that all actions related to administrative functionality such as application server configuration are logged. Satisfies: SRG-APP-000016-AS-000013, SRG-APP-000343-AS-000030","fixText":"Document all groups in an Auditor role in the security plan.\r\n\r\nIn the administrative console, navigate to Users and Groups >> Administrative group roles.\r\n\r\nIf an unauthorized group is in the auditor role, remove the auditor role from the group.\r\n\r\nRestart the DMGR and all the JVMs.","checkText":"Review System Security Plan documentation.\r\n\r\nIdentify groups and roles.\r\n\r\nIn the administrative console, navigate to Users and Groups >> Administrative Group Roles.\r\n\r\nCheck the roles for each group and compare to System Security Plan.\r\n\r\nIf any group is not authorized by the ISSO/ISSM to be in an auditor role, this is a finding.","cciIds":["CCI-000067","CCI-002234"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-95921r1_rule","stigId":"V-81207","groupId":"V-81207","title":"DPMS Target WebSphere AS 9.x","severity":"CAT II","description":"Logging must be utilized in order to track system activity, assist in diagnosing system issues, and provide evidence needed for forensic investigations post security incident. Remote access by administrators requires that the admin activity be logged. Application servers provide a web and command line-based remote management capability for managing the application server. Application servers must ensure that all actions related to administrative functionality such as application server configuration are logged. Satisfies: SRG-APP-000016-AS-000013, SRG-APP-000343-AS-000030, SRG-APP-000090-AS-000051","fixText":"In the administrative console, navigate to Users and Groups >> Administrative User roles.\r\n\r\nIf an unauthorized user is in the auditor role, remove the user from the auditor role.\r\n\r\nRestart the DMGR and all the JVMs.","checkText":"Review System Security Plan documentation.\r\n\r\nIdentify users and roles.\r\n\r\nIn the administrative console, navigate to Users and Groups >> Administrative User Roles.\r\n\r\nCheck the roles for each user.\r\n\r\nIf any user is not authorized by the ISSO/ISSM to be in the role of an auditor, this is a finding.","cciIds":["CCI-000067","CCI-000171","CCI-002234"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-95923r1_rule","stigId":"V-81209","groupId":"V-81209","title":"DPMS Target WebSphere AS 9.x","severity":"CAT II","description":"Logging must be utilized in order to track system activity, assist in diagnosing system issues, and provide evidence needed for forensic investigations post security incident. Remote access by administrators requires that the admin activity be logged. Application servers provide a web and command line-based remote management capability for managing the application server. Application servers must ensure that all actions related to administrative functionality such as application server configuration are logged. Satisfies: SRG-APP-000016-AS-000013, SRG-APP-000343-AS-000030, SRG-APP-000089-AS-000050, SRG-APP-000495-AS-000220, SRG-APP-000499-AS-000224, SRG-APP-000503-AS-000228, SRG-APP-000504-AS-000229, SRG-APP-000505-AS-000230, SRG-APP-000506-AS-000231, SRG-APP-000093-AS-000054, SRG-APP-000095-AS-000056, SRG-APP-000097-AS-000060, SRG-APP-000098-AS-000061, SRG-APP-000099-AS-000062, SRG-APP-000100-AS-000063, SRG-APP-000101-AS-000072, SRG-APP-000381-AS-000089, SRG-APP-000080-AS-000045","fixText":"In the administrative console, navigate to Security >> Security auditing >> Event type Filters.\r\n\r\nClick the \"New\" button to create a new filter; give it a unique name. \r\n\r\nSelect SECURITY_AUTHN, SECURITY_AUTHZ, SECURITY_AUTHN_TERMINATE, and ADMIN_REPOSITORY_SAVE from \"Selectable events\".\r\n\r\nAdd them to the \"Enabled events\" box by clicking on the right arrow. \r\n\r\nSelect INFO, ERROR, SUCCESS, DENIED, REDIRECT, and WARNING from the \"Selectable event outcomes\" box.\r\n\r\nClick the right arrow to fill in \"Enabled events outcomes\" box.\r\n\r\nClick \"OK\". \r\n\r\nRestart the DMGR and all the JVMs.","checkText":"In the administrative console, navigate to Security >> Security auditing >> Event type Filters.\r\n\r\nVerify the following events and outcomes are enabled in the \"Events and Outcomes\" box. Also note the name of the filter associated with these events. This name will be referenced in STIG ID WBSP-AS-000110.\r\n\r\nAUTHN: \r\nSUCCESS,INFO,WARNING,ERROR,DENIED,REDIRECT\r\n\r\nAUTHZ: \r\nSUCCESS,INFO,WARNING,ERROR,DENIED,REDIRECT\r\n\r\nAUTHN_TERMINATE:\r\nSUCCESS,INFO,WARNING,ERROR,DENIED,REDIRECT\r\n\r\nREPOSITORY_SAVE: SUCCESS,INFO,WARNING,ERROR,DENIED,REDIRECT\r\n\r\nIf these audit filters are not configured in \"Events and Outcomes\", this is a finding.","cciIds":["CCI-000067","CCI-000130","CCI-000132","CCI-000133","CCI-000134","CCI-000135","CCI-000169","CCI-000172","CCI-001462","CCI-001487","CCI-001814","CCI-002234"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-95925r1_rule","stigId":"V-81211","groupId":"V-81211","title":"DPMS Target WebSphere AS 9.x","severity":"CAT II","description":"Logging must be utilized in order to track system activity, assist in diagnosing system issues, and provide evidence needed for forensic investigations post security incident. Remote access by administrators requires that the admin activity be logged. Application servers provide a web and command line-based remote management capability for managing the application server. Application servers must ensure that all actions related to administrative functionality such as application server configuration are logged. Satisfies: SRG-APP-000016-AS-000013, SRG-APP-000343-AS-000030","fixText":"In the administrative console, navigate to Security >> Security auditing >> Event type Filters.\r\n\r\nIdentify and record the event type filter that contains the required \"Events and Outcomes\".\r\n\r\nIn the administrative console, click on Security >> Security auditing >> Audit Service Provider [provider name]. \r\n\r\nUnder \"Selectable filters\", select the filter that was previously identified and recorded.\r\n\r\nClick the right arrow to add it to the list.\r\n\r\nClick \"OK\".\r\n\r\nClick \"Save\" to save the changes.\r\n\r\nRestart the DMGR and all the JVMs.","checkText":"In the administrative console, navigate to Security >> Security auditing >> Audit Service Provider [provider name]. \r\n\r\nUnder \"Enabled filters\", determine if the filter name from select the name of the filter that was recorded from STIG ID WBSP-AS-000100.\r\n\r\nIf the filter that was identified in STIG ID WBSP-AS-000100 is not enabled, this is a finding.","cciIds":["CCI-000067","CCI-002234"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-95927r1_rule","stigId":"V-81213","groupId":"V-81213","title":"DPMS Target WebSphere AS 9.x","severity":"CAT II","description":"Application servers provide remote access capability and must be able to enforce remote access policy requirements or work in conjunction with enterprise tools designed to enforce policy requirements. Automated monitoring and control of remote access sessions allows organizations to detect cyber attacks and also ensure ongoing compliance with remote access policies by logging connection activities of remote users. Examples of policy requirements include, but are not limited to, authorizing remote access to the information system, limiting access based on authentication credentials, and monitoring for unauthorized access. Satisfies: SRG-APP-000315-AS-000094, SRG-APP-000380-AS-000088, SRG-APP-000133-AS-000092, SRG-APP-000033-AS-000024, SRG-APP-000153-AS-000104","fixText":"From administrative console, navigate to Users and Groups >> Administrative group roles.\r\n\r\nNote: names of the groups and the roles assigned to each group.\r\n\r\nNavigate back to User and Groups >> Manage Groups.\r\n\r\nClick on every group.\r\n\r\nFor each group, click on users.\r\n\r\nIf there is any user who does not belong to the group based on the roles assigned to the group, click on the checkbox next to the user.\r\n\r\nClick \"Remove\".\r\n\r\nRestart the DMGR and all the JVMs.","checkText":"If the systems user registry is managed by LDAP, this requirement is NA.\r\n\r\nReview the System Security Plan documentation.\r\n\r\nInterview the system administrator.\r\n\r\nObtain a list of authorized users.\r\n\r\nIn the administrative console, navigate to Users and Groups >> Manage Groups.\r\n\r\nSelect each group.\r\n\r\nSelect the \"Members\" tab.\r\n\r\nValidate the members of the group are authorized.\r\n\r\nIf users in the group are not authorized by the ISSO/ISSM, this is a finding.","cciIds":["CCI-000213","CCI-000770","CCI-001499","CCI-001813","CCI-002314"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-95929r1_rule","stigId":"V-81215","groupId":"V-81215","title":"DPMS Target WebSphere AS 9.x","severity":"CAT II","description":"Quality of Protection specifies the security level, ciphers, and mutual authentication settings for the Secure Socket Layer (SSL/TLS) configuration.","fixText":"From the administrative console, navigate to Security >> SSL certificate and key management.\r\n\r\nClick \"SSL configurations\".\r\n\r\nClick on each SSL configuration.\r\n\r\nUnder \"Additional Properties\", click \"Quality of protection (QoP)\" settings.\r\n\r\nAt the \"Protocol\" pull-down menu, select \"TLSv1.2 or greater\".\r\n\r\nClick \"OK\".\r\n\r\nClick \"Save\".\r\n\r\nRestart the DMGR and all the JVMs.","checkText":"From the administrative console, navigate to Security >> SSL certificate and key management.\r\n\r\nClick \"SSL configurations\".\r\n\r\nClick on each SSL configuration to review.\r\n\r\nUnder \"Additional Properties\", click \"Quality of protection (QoP)\" settings.\r\n\r\nIf the \"Protocol\" field does not show \"TLSv1.2 or greater\", this is a finding.","cciIds":["CCI-000068"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-95931r1_rule","stigId":"V-81217","groupId":"V-81217","title":"DPMS Target WebSphere AS 9.x","severity":"CAT I","description":"Application security enables security for the applications in your environment. This setting provides application isolation and meets security requirements such as using SSL for authenticating application users. In previous releases of WebSphere® Application Server, when a user enabled global security, both administrative and application security were enabled. The previous notion of global security is split into administrative security and application security, each of which you can enable separately. As a result of this split, WebSphere Application Server clients must know whether application security is disabled at the target server. Administrative security is enabled, by default. Application security is disabled, by default. Before you can enable application security, you must verify that administrative security is enabled. Application security is in effect only when administrative security is enabled. Satisfies: SRG-APP-000014-AS-000009, SRG-APP-000172-AS-000120","fixText":"From the administrative console, navigate to Security >> Global Security.\r\n\r\nClick on \"Enable administrative security\".\r\n\r\nClick on \"Enable application security\".\r\n\r\nClick \"OK\".\r\n\r\nClick \"Save\".\r\n\r\nRestart the DMGR and all the JVMs.","checkText":"From the administrative console, navigate to Security >> Global Security.\r\n\r\nIf \"Enable administrative security\" and \"Enable application security\" are not selected, this is a finding.","cciIds":["CCI-000068","CCI-000197"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-95933r1_rule","stigId":"V-81219","groupId":"V-81219","title":"DPMS Target WebSphere AS 9.x","severity":"CAT I","description":"Remote management access is accomplished by leveraging common communication protocols and establishing a remote connection to the application server via a network for the purposes of managing the application server. If cryptography is not used, then the session data traversing the remote connection could be intercepted and compromised. Types of management interfaces utilized by an application server include web-based HTTPS interfaces as well as command line-based management interfaces. Satisfies: SRG-APP-000014-AS-000009, SRG-APP-000172-AS-000120, SRG-APP-000158-AS-000108","fixText":"From the administrative console, navigate to Security >> Global Security.\r\n\r\nExpand \"Web and SIP security\".\r\n\r\nClick on \"Single sign-on (SSO)\".\r\n\r\nSelect \"Requires SSL\".\r\n\r\nClick \"OK\".\r\n\r\nClick \"Save\".\r\n\r\nRestart the DMGR and all the JVMs.","checkText":"From the administrative console, navigate to Security >> Global Security.\r\n\r\nExpand \"Web and SIP security\".\r\n\r\nClick on \"Single sign-on (SSO)\".\r\n\r\nIf \"requires SSL\" is not selected, this is a finding.","cciIds":["CCI-000068","CCI-000197","CCI-000778"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-95935r1_rule","stigId":"V-81221","groupId":"V-81221","title":"DPMS Target WebSphere AS 9.x","severity":"CAT II","description":"Web applications use cookies to track users across requests. These cookies, while typically not sensitive in themselves, connect you to your existing state on the back end system. If an intruder were to capture one of your cookies, they could potentially use the cookie to act as you. Important Web traffic should be encrypted using SSL. This includes important cookies. In the case of WebSphere Application Server, the most important cookie is the LTPA cookie, and therefore it should be configured to be sent only over SSL.","fixText":"From the administrative console, navigate to Security >> Global Security.\r\n\r\nExpand \"Web and SIP security\".\r\n\r\nSelect \"Set security cookies to HTTPOnly\".\r\n\r\nClick \"OK\".\r\n\r\nClick \"Save\".\r\n\r\nRestart the DMGR and all the JVMs.","checkText":"From the administrative console, navigate to Security >> Global Security.\r\n\r\nExpand \"Web and SIP security\".\r\n\r\nClick on \"Single sign-on (SSO)\".\r\n\r\nIf \"Set security cookies to HTTPOnly\" is not selected, this is a finding.","cciIds":["CCI-001453"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-95937r1_rule","stigId":"V-81223","groupId":"V-81223","title":"DPMS Target WebSphere AS 9.x","severity":"CAT I","description":"Java 2 security provides a policy-based fine grained access control mechanism that increases overall system integrity by checking for permissions before allowing access to certain protected system resources. Java 2 Security is independent on J2EE role-based authorization. Java 2 Security guards access to system resources such as file input and output, sockets, and properties, whereas J2EE security guards access to Web resources such as servlets and JSP files. Administrators should understand the possible consequences of enabling Java 2 Security if applications are not prepared for Java 2 Security. Java 2 Security places some new requirements on application developers and administrators. Admins need to make sure that all the applications are granted the required permissions; otherwise, applications may fail to run. By default, applications are granted the permissions recommended in the J2EE 1.3 Specification. For details of default permissions granted to applications in WebSphere, please refer to the following policy files: /QIBM/ProdData/Java400/jdk14/lib/security/java.policy /QIBM/UserData/WebASE51/ASE/instance/properties/server.policy /QIBM/UserData/WebASE51/ASE/instance/config/cells/cell/nodes/node/app.policy where instance is the name of your instance, cell is the name of your cell, and node is the name of your node.","fixText":"From the admin console, select Security >> Global Security >> Java 2 Security.\r\n\r\nSelect the \"Use Java 2 security to restrict application access to local resources\" check box.\r\n\r\nEnsure the application security policies are defined and access permissions are granted accordingly.\r\n\r\nPolicies are created and access is granted on an application by application basis. Application access to the underlying host is based upon application access requirements.","checkText":"From the admin console, select Security >> Global Security >> Java 2 Security. \r\n\r\nIf \"Use Java 2 security to restrict application access to local resources\" is not selected, this is a finding.","cciIds":["CCI-000213"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-95939r1_rule","stigId":"V-81225","groupId":"V-81225","title":"DPMS Target WebSphere AS 9.x","severity":"CAT I","description":"WebSphere provides a passive filter mechanism that will allow administrators to set Java 2 security in the admin console as enabled while still allowing applications to access host resources. This setting bypasses the enforcement of Java2 security. Application access is allowed and activity is logged to the system.out file. This feature is to aid in the identification of application access requirements to the underlying host so security policies can be created. This feature is executed via a custom property that is set for each application server instance operating on the WebSphere server. This setting should only be enabled in a development or testing environment in order to identify what applications access requirements are so security policies can then be created.","fixText":"From the admin console, select Servers >> Server Types >> WebSphere application servers.\r\n\r\nFor each application server, select Server Infrastructure >> Administration >> Custom properties.\r\n\r\nDelete the \"com.ibm.websphere.java2secman.norethrow\" resource value from production systems.","checkText":"If the system is a development or test system, this requirement is NA.\r\n\r\nFrom the admin console, select Servers >> Server Types >> WebSphere application servers.\r\n\r\nFor each application server, select Server Infrastructure >> Administration >> Custom properties.\r\n\r\nIf the \"com.ibm.websphere.java2secman.norethrow\" resource value exists and is set to \"true\", this is a finding.","cciIds":["CCI-000213"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-95941r1_rule","stigId":"V-81227","groupId":"V-81227","title":"DPMS Target WebSphere AS 9.x","severity":"CAT II","description":"Strong access controls are critical to securing the application server. Access control policies (e.g., identity-based policies, role-based policies, attribute-based policies) and access enforcement mechanisms (e.g., access control lists, access control matrices, cryptography) must be employed by the application server to control access between users (or processes acting on behalf of users) and objects (e.g., applications, files, records, processes, application domains) in the application server. Without stringent logical access and authorization controls, an adversary may have the ability, with very little effort, to compromise the application server and associated supporting infrastructure. Satisfies: SRG-APP-000033-AS-000024, SRG-APP-000380-AS-000088, SRG-APP-000340-AS-000185","fixText":"Navigate to User and Groups >> Administrative user roles.\r\n\r\nIf an unauthorized user is assigned to the admin role, click on the user, remove admin rights and assign proper roles as defined in System Security Plan.\r\n\r\nDo not delete any user with the \"Primary administrative user name\" designation.\r\n\r\nClick \"OK\".\r\n\r\nClick \"Save\".\r\n\r\nRestart the DMGR and all the JVMs.","checkText":"Review System Security Plan documentation.\r\n\r\nIn the administrative console, navigate to Users and Groups >> Administrative user roles.\r\n\r\nIf users assigned to the admin role are not authorized by the ISSO/ISSM, this is a finding.","cciIds":["CCI-000213","CCI-001813","CCI-002235"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-95943r1_rule","stigId":"V-81229","groupId":"V-81229","title":"DPMS Target WebSphere AS 9.x","severity":"CAT II","description":"Strong access controls are critical to securing the application server. Access control policies (e.g., identity-based policies, role-based policies, attribute-based policies) and access enforcement mechanisms (e.g., access control lists, access control matrices, cryptography) must be employed by the application server to control access between users (or processes acting on behalf of users) and objects (e.g., applications, files, records, processes, application domains) in the application server. Without stringent logical access and authorization controls, an adversary may have the ability, with very little effort, to compromise the application server and associated supporting infrastructure. Satisfies: SRG-APP-000033-AS-000024, SRG-APP-000267-AS-000170","fixText":"Navigate to User and Groups >> Administrative group roles.\r\n\r\nIf any group is assigned roles that the group should not have, click on the group.\r\n\r\nAssign only the role(s) the group should have.\r\n\r\nClick \"OK\".\r\n\r\nClick \"Save\". \r\n\r\nRestart the DMGR and all the JVMs.","checkText":"Review System Security Plan documentation.\r\n\r\nReview details regarding LDAP groups that are mapped to WebSphere roles. \r\n\r\nIn the administrative console, under Users and Groups >> Administrative group roles.\r\n\r\nIf there is a LDAP group or groups assigned to a WebSphere role that has not been authorized by the ISSO/ISSM, this is a finding.","cciIds":["CCI-000213","CCI-001314"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-95945r1_rule","stigId":"V-81231","groupId":"V-81231","title":"DPMS Target WebSphere AS 9.x","severity":"CAT II","description":"Preventing non-privileged users from executing privileged functions mitigates the risk that unauthorized individuals or processes may gain unnecessary access to information or privileges. Restricting non-privileged users also prevents an attacker, who has gained access to a non-privileged account, from elevating privileges, creating accounts, and performing system checks and maintenance.","fixText":"In the LDAP server admin console, assign WebSphere users to the appropriate WebSphere group.","checkText":"If a file based or local federated repository is in use, this requirement is NA.\r\n\r\nReview System Security Plan documentation.\r\n\r\nInterview the system administrator.\r\n\r\nIn the administrative console select Security >> Global Security.\r\n\r\nUnder \"User Account Repository\", verify the \"Available realm Definition\" is set to \"Standalone LDAP registry\".\r\n\r\nSelect \"Configure\".\r\n\r\nThe properties of the LDAP repository are displayed for purposes of identifying the LDAP server.\r\n\r\nWork with the admin of LDAP repository.\r\n\r\nIdentify users and groups.\r\n\r\nValidate members of groups are authorized.\r\n\r\nIf the group members have not been authorized by the ISSO/ISSM, this is a finding.","cciIds":["CCI-002235"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-95947r1_rule","stigId":"V-81233","groupId":"V-81233","title":"DPMS Target WebSphere AS 9.x","severity":"CAT II","description":"Application servers are required to display the Standard Mandatory DoD Notice and Consent Banner before granting access to the system management interface, providing privacy and security notices consistent with applicable federal laws, Executive Orders, directives, policies, regulations, standards, and guidance that states that: (i) users are accessing a U.S. Government information system; (ii) system usage may be monitored, recorded, and subject to audit; (iii) unauthorized use of the system is prohibited and subject to criminal and civil penalties; and (iv) the use of the system indicates consent to monitoring and recording. System use notification messages can be implemented in the form of warning banners displayed when individuals log on to the information system. System use notification is intended only for information system access including an interactive logon interface with a human user, and is not required when an interactive interface does not exist. Use this banner for desktops, laptops, and other devices accommodating banners of 1300 characters. The banner shall be implemented as a click-through banner at logon (to the extent permitted by the operating system), meaning it prevents further activity on the information system unless and until the user executes a positive action to manifest agreement by clicking on a box indicating \"OK\". \"You are accessing a U.S. Government (USG) Information System (IS) that is provided for USG-authorized use only. By using this IS (which includes any device attached to this IS), you consent to the following conditions: -The USG routinely intercepts and monitors communications on this IS for purposes including, but not limited to, penetration testing, COMSEC monitoring, network operations and defense, personnel misconduct (PM), law enforcement (LE), and counterintelligence (CI) investigations. -At any time, the USG may inspect and seize data stored on this IS. -Communications using, or data stored on, this IS are not private, are subject to routine monitoring, interception, and search, and may be disclosed or used for any USG-authorized purpose. -This IS includes security measures (e.g., authentication and access controls) to protect USG interests--not for your personal benefit or privacy. -Notwithstanding the above, using this IS does not constitute consent to PM, LE or CI investigative searching or monitoring of the content of privileged communications, or work product, related to personal representation or services by attorneys, psychotherapists, or clergy, and their assistants. Such communications and work product are private and confidential. See User Agreement for details.\"","fixText":"Open the file ${WAS_HOME}/properties/login.info.\r\n\r\nFollow the instructions in the HTML comment section to create the pre-logon banner.\r\n\r\nEnter the Standard DoD Mandatory Notice and Consent banner into the HTML section.\r\n\r\nIf logged on to the admin console, log out and log back on to validate the changes.\r\n\r\nRestart the DMGR and all the JVMs.","checkText":"Point browser to the URL of the WebSphere administration console.\r\n\r\nIf the Standard Mandatory DoD Notice and Consent Banner is not displayed, this is a finding.","cciIds":["CCI-000048"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-95949r1_rule","stigId":"V-81235","groupId":"V-81235","title":"DPMS Target WebSphere AS 9.x","severity":"CAT II","description":"To establish acceptance of system usage policy, a click-through banner at the application server management interface logon is required. The banner shall prevent further activity on the application server unless and until the user executes a positive action to manifest agreement by clicking on a box indicating \"OK\".","fixText":"Open the file ${WAS_HOME}/properties/login.info.\r\n\r\nFollow the instructions in the HTML comment section to create the pre-logon banner.\r\n\r\nEnter the Standard DoD Mandatory Notice and Consent banner into the HTML section.\r\n\r\nIf logged on to the admin console, log out and log back on to validate the changes.\r\n\r\nRestart the DMGR and all the JVMs.","checkText":"Point browser to the URL of the WebSphere administration console.\r\n\r\nIf the Standard Mandatory DoD Notice and Consent Banner is not retained until the user acknowledges the usage conditions, this is a finding.","cciIds":["CCI-000050"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-95951r1_rule","stigId":"V-81237","groupId":"V-81237","title":"DPMS Target WebSphere AS 9.x","severity":"CAT III","description":"Accessing a subject's privileges can be used to elevate a lower-privileged subject's privileges temporarily in order to cause harm to the application server or to gain privileges to operate temporarily for a designed purpose. When these actions take place, the event needs to be logged. Application servers either provide a local user store, or they integrate with enterprise user stores like LDAP. When the application server provides the user store and enforces authentication, the application server must generate a log record when modification of privileges is successfully or unsuccessfully performed.","fixText":"In the administrative console, navigate to Security >> Security auditing >> Audit Service Provider.\r\n\r\nClick on the providers in the list.\r\n\r\nNote the names of all the filters, e.g., \"DefaultAuditSpecification_1\".\r\n\r\nGo back to Security >> Security auditing >> Event type Filters.\r\n\r\nFind the filters previously noted.\r\n\r\nIf you do not see that the provider filter for SECURITY_AUTHN, SECURITY_AUTHZ, SECURITY_AUTHN_TERMINATE, and ADMIN_REPOSITORY_SAVE that has INFO, ERROR, SUCCESS, DENIED, REDIRECT, and WARNING defined, click the \"New\" button to create a new filter.\r\n\r\nGive it a unique name.\r\n\r\nSelect \"SECURITY_AUTHN\" and \"ADMIN_REPOSITORY_SAVE\" from the \"Events to associate with audit filter\" field.\r\n\r\nClick the right arrow to fill in \"Enabled events\" field.\r\n\r\nFrom \"Event outcomes to associate with an audit filter\" field, select INFO, ERROR, SUCCESS, DENIED, REDIRECT, and WARNING.\r\n\r\nClick the right arrow to fill in \"Enabled event outcomes\" field.\r\n\r\nClick \"OK\".\r\n\r\nGo back to Security >> Security auditing >> Audit Service Provider >> [provider].\r\n\r\nUnder \"Selectable filters\", select the new filter just created.\r\n\r\nClick the right arrow to add it to the list.\r\n\r\nClick \"OK\".\r\n\r\nClick \"Save\".\r\n\r\nRestart the DMGR and all the JVMs.","checkText":"In the administrative console, navigate to Security >> Security auditing >> Audit Service Provider.\r\n\r\nClick on the providers in the list.\r\n\r\nNote: names of all the filters, e.g., \"DefaultAuditSpecification_1\".\r\n\r\nGo back to Security >> Security auditing >> Event type Filters.\r\n\r\nFind the filters previously noted.\r\n\r\nIf you do not see the filter for SECURITY_AUTHN, SECURITY_AUTHZ, SECURITY_AUTHN_TERMINATE, and ADMIN_REPOSITORY_SAVE that has INFO, ERROR, SUCCESS, DENIED, REDIRECT, and WARNING defined, this is a finding.","cciIds":["CCI-000172"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-95953r1_rule","stigId":"V-81239","groupId":"V-81239","title":"DPMS Target WebSphere AS 9.x","severity":"CAT II","description":"JVM logs are logs used to store application and runtime related events, rather than audit related events. They are mainly used to diagnose application or runtime bugs. But sometimes they may be useful in providing more context when correlated with audit related events. The proper management of log records not only dictates proper archiving processes and procedures be established, it also requires allocating enough storage space to maintain the logs online for a defined period of time. If adequate online log storage capacity is not maintained, intrusion monitoring, security investigations, and forensic analysis can be negatively affected. It is important to keep a defined amount of logs online and readily available for investigative purposes. The logs may be stored on the application server until they can be archived to a log system or, in some instances, a Storage Area Networks (SAN). Regardless of the method used, log record storage capacity must be sufficient to store log data when the data cannot be offloaded to a log system or SAN.","fixText":"Identify JVM log size and history retention based on component log policy.\r\n\r\nDocument those values in the System Security Plan.\r\n\r\nFrom the administrative console, navigate to Troubleshooting >> Logs and Trace.\r\n\r\nSelect each [server name].\r\n\r\nClick \"JVM\" Logs. \r\n\r\nUnder \"System.out\", \"Log Rotation\", select \"File size\" in the \"Maximum Size\" entry field, enter the maximum log size based on policy.\r\n\r\nUnder \"System.err\", \"Log Rotation\", select \"File Size\" in the \"Maximum Size\" entry field, enter the maximum log size based on policy.\r\n\r\nClick \"OK\".\r\n\r\nClick \"Save\".","checkText":"Review System Security Plan documentation.\r\n\r\nIdentify the JVM log size and rotation settings based on component log policy.\r\n\r\nFrom the administrative console, navigate to Troubleshooting >> Logs and Trace.\r\n\r\nChoose [server name].\r\n\r\nClick on the server name to select it.\r\n\r\nClick \"JVM\" Logs.\r\n\r\nFor \"System.out\" verify \"File Size\" is selected and \"Maximum size\" and \"Maximum Historical Log Files\" are set according to the System Security Plan. \r\n\r\nFor \"System.err\" verify \"File Size\" is selected and \"Maximum size\" and \"Maximum Historical Log Files\" are set according to the System Security Plan. \r\n\r\nIf log size and log history retention settings for \"System.err\" and \"System.out\" are not set as per the System Security Plan, this is a finding.","cciIds":["CCI-001849"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-95955r1_rule","stigId":"V-81241","groupId":"V-81241","title":"DPMS Target WebSphere AS 9.x","severity":"CAT II","description":"The proper management of log records not only dictates proper archiving processes and procedures be established, it also requires allocating enough storage space to maintain the logs online for a defined period of time. If adequate online log storage capacity is not maintained, intrusion monitoring, security investigations, and forensic analysis can be negatively affected. It is important to keep a defined amount of logs online and readily available for investigative purposes. The logs may be stored on the application server until they can be archived to a log system or, in some instances, a Storage Area Networks (SAN). Regardless of the method used, log record storage capacity must be sufficient to store log data when the data cannot be offloaded to a log system or SAN.","fixText":"Identify Audit Service Provider log size and history retention based on component log policy.\r\n\r\nDocument those values in the System Security Plan.\r\n\r\nFrom administrative console, click Security >> Security auditing >>Related Items>> Audit service provider >> [audit_service_provider_name].\r\n\r\nUnder Audit log file size specify the size of the file in MB as defined by your policy.\r\n\r\nUnder \"Maximum number of audit logs files\", specify the maximum number of logs you want to keep on the file system as defined by your policy.\r\n\r\nClick \"OK\".\r\n\r\nClick \"Save\".","checkText":"Review System Security Plan documentation.\r\n\r\nIdentify the Audit Service Provider log size and rotation settings based on component log policy.\r\n\r\nFrom administrative console, click Security >> Security auditing >> Audit service provider.\r\n\r\nSelect each [audit_service_provider_name].\r\n\r\nIf \"Audit Log Size\" and \"Max Number of Audit Log Files\" are not configured as per the System Security Plan, this is a finding.","cciIds":["CCI-001849"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-95957r1_rule","stigId":"V-81243","groupId":"V-81243","title":"DPMS Target WebSphere AS 9.x","severity":"CAT II","description":"It is critical for the appropriate personnel to be aware if a system is at risk of failing to process logs as required. Log processing failures include software/hardware errors, failures in the log capturing mechanisms, and log storage capacity being reached or exceeded. Notification of the failure event will allow administrators to take actions so that logs are not lost.","fixText":"Establish and utilize a notification process for WebSphere log events or configure WebSphere to send log events alerts via email.\r\n\r\nIn the administrative console, navigate to Security >> Security auditing >> Audit monitor.\r\n\r\nSelect a \"Monitor\" notification from the dropdown box or create a new notification.\r\n\r\nClick on \"New\".\r\n\r\nSpecify a unique name for the new notification.\r\n\r\nClick \"Message log\" checkbox.\r\n\r\nSelect \"Email sent to notification list\".\r\n\r\nEnter emails in the \"Email address to add\" field.\r\n\r\nEnter the mail server address in the \"Outgoing mail (STMP) server\" field.\r\n\r\nClick \">\" to put email in \"List of email addresses\" field.\r\n\r\nClick \"OK\".\r\n\r\nSelect the \"Enable monitoring\" check box to turn on audit failure notifications.\r\n\r\nSelect the notification configuration to be used from the \"Monitor notification\" dropdown menu.\r\n\r\nClick \"OK\".\r\n\r\nClick \"Save\".","checkText":"If notifications of log processing failures are done via an alternative notification process, this is not a finding.\r\n\r\nIn the administrative console, navigate to Security >> Security auditing >> Audit monitor.\r\n\r\nIf \"Enabled monitoring\" is not checked and \"Monitor notification\" is not set to a name in the notifications list, this is a finding.","cciIds":["CCI-001858"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-95959r1_rule","stigId":"V-81245","groupId":"V-81245","title":"DPMS Target WebSphere AS 9.x","severity":"CAT III","description":"Logs are essential to monitor the health of the system, investigate changes that occurred to the system, or investigate a security incident. When log processing fails, the events during the failure can be lost. To minimize the timeframe of the log failure, an alert needs to be sent to the SA and ISSO at a minimum. Log processing failures include, but are not limited to, failures in the application server log capturing mechanisms or log storage capacity being reached or exceeded. In some instances, it is preferred to send alarms to individuals rather than to an entire group. Application servers must be able to trigger an alarm and send an alert to, at a minimum, the SA and ISSO in the event there is an application server log processing failure.","fixText":"Establish and utilize a notification process for WebSphere log events or configure WebSphere to send log event alerts via email.\r\n\r\nIn the administrative console, navigate to Security >> Security auditing >> Audit monitor.\r\n\r\nClick on \"New\" button.\r\n\r\nSpecify a unique name for the new notification name.\r\n\r\nClick \"Message log\" checkbox.\r\n\r\nSelect \"Email sent to notification list\".\r\n\r\nEnter SA and ISSO emails in the \"Email address to add\" field.\r\n\r\nEnter the mail server address in the \"Outgoing mail (STMP) server\" field.\r\n\r\nClick \">\" to put email in \"List of email addresses\" field.\r\n\r\nClick \"OK\".\r\n\r\nSelect the \"Enable monitoring\" check box to turn on audit failure notifications.\r\n\r\nSelect the notification configuration to be used from the \"Monitor notification\" dropdown menu.\r\n\r\nClick \"OK\".\r\n\r\nClick \"Save\".","checkText":"If the SA and ISSO are notified of log processing failures via an alternative notification process, this is not a finding.\r\n\r\nIn the administrative console, navigate to Security >> Security auditing >> Audit monitor.\r\n\r\nIf \"Enabled monitoring\" is not checked and \"Monitor notification\" is not set to a notification in the notifications list, that includes the SA and ISSO, this is a finding.","cciIds":["CCI-000139"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-95961r1_rule","stigId":"V-81247","groupId":"V-81247","title":"DPMS Target WebSphere AS 9.x","severity":"CAT II","description":"Logs are essential to monitor the health of the system, investigate changes that occurred to the system, or investigate a security incident. When log processing fails, the events during the failure can be lost. To minimize the timeframe of the log failure, an alert needs to be sent to the SA and ISSO at a minimum. Log processing failures include, but are not limited to, failures in the application server log capturing mechanisms or log storage capacity being reached or exceeded. WebSphere must be set to log warnings that the audit subsystem has failed or is in danger or failing so action can be taken to correct the issue.","fixText":"In the administrative console, navigate to Security >> Security auditing.\r\n\r\nClick the \"Audit subsystem failure action\" dropdown box.\r\n\r\nSelect \"Log Warning\".\r\n\r\nClick \"Apply\".\r\n\r\nClick \"Save\" to save the configuration.\r\n\r\nRestart the DMGR and all JVMs.","checkText":"In the administrative console, navigate to Security >> Security auditing.\r\n\r\nIf \"Audit subsystem failure action\" is not set to \"Log Warning\", this is a finding.","cciIds":["CCI-000139"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-95963r1_rule","stigId":"V-81249","groupId":"V-81249","title":"DPMS Target WebSphere AS 9.x","severity":"CAT III","description":"It is critical that, when a system is at risk of failing to process logs, it detects and takes action to mitigate the failure. Log processing failures include software/hardware errors, failures in the log capturing mechanisms, and log storage capacity being reached or exceeded. During a failure, the application server must be configured to shut down unless the application server is part of a high availability system or availability is an overriding concern. When availability is an overriding concern, other approved actions in response to a log failure include: (i) If the failure was caused by the lack of log record storage capacity, the application must continue generating log records if possible (automatically restarting the log service if necessary), overwriting the oldest log records in a first-in-first-out manner. (ii) If log records are sent to a centralized collection server and communication with this server is lost or the server fails, the application must queue log records locally until communication is restored or until the log records are retrieved manually. Upon restoration of the connection to the centralized collection server, action should be taken to synchronize the local log data with the collection server. If the server will continue to process without any logging mitigations in place and the availability of the server is not critical to the success of the mission, the server must be configured to shut down on log failure.","fixText":"In the admin console click Security >> Security Auditing.\r\n\r\nSet \"Audit subsystem failure action\" to \"Terminate\".\r\n\r\nRestart the DMGR and all JVMs.","checkText":"If the System Security Plan documentation specifies system availability is an overriding concern, this requirement is NA.\r\n\r\nIn the admin console click Security >> Security Auditing.\r\n\r\nIf \"Audit subsystem failure action\" is not set to \"Terminate\", this is a finding.","cciIds":["CCI-000140"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-95965r1_rule","stigId":"V-81251","groupId":"V-81251","title":"DPMS Target WebSphere AS 9.x","severity":"CAT III","description":"This requirement is dependent upon system MAC and availability. If the system MAC and availability do not specify redundancy requirements, this requirement is NA. It is critical that, when a system is at risk of failing to process logs as required, it detects and takes action to mitigate the failure. Application servers must be capable of failing over to another system which can handle application and logging functions upon detection of an application log processing failure. This will allow continual operation of the application and logging functions while minimizing the loss of operation for the users and loss of log data.","fixText":"In the admin console, Click Servers >> Clusters >> WebSphere application server clusters.\r\n\r\nDefine a cluster for every high availability application as outlined in the System Security Plan documentation.\r\n\r\nRefer to vendor documentation for steps on creating a fail over cluster.","checkText":"If the System Security Plan documentation does not require redundancy, this requirement is NA.\r\n\r\nClick Servers >> Clusters >> WebSphere application server clusters.\r\n\r\nEnsure you have a cluster defined for every application requiring redundancy.\r\n\r\nIf there is not a cluster defined for every application requiring redundancy, this is a finding.","cciIds":["CCI-000140"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-95967r1_rule","stigId":"V-81253","groupId":"V-81253","title":"DPMS Target WebSphere AS 9.x","severity":"CAT III","description":"WebSphere uses role-based access controls to restrict access to log data. To take advantage of this capability, WebSphere administrators must identify specific users and place them into their respective roles. The auditor role is used for controlling access to logs.","fixText":"On the system hosting the WebSphere application server, log on to the operating system with admin rights.\r\n\r\nNavigate to the WebSphere folder, change permissions on the folder. Do not propagate permissions to sub-folders.\r\n\r\nFor UNIX systems: set \"WebSphere\" folder permissions to \"770\". \r\n\r\nFor Windows systems: set \"WebSphere\" folder permission to allow full control for SYSTEM, WebSphere user and Admin Group. Do not propagate permissions to sub-folders.","checkText":"Review system documentation and System Security Plan.\r\n\r\nIdentify the home folder and user account for the WebSphere installation.\r\n\r\nLog on to the operating system that is hosting the WebSphere application server. By default, WebSphere will be installed in the \"/opt/IBM/Websphere\" folder on UNIX like systems and in the \"C:\\Program Files\\IBM\\Websphere\\\" folder on Windows systems.\r\n\r\nOn UNIX systems, verify file permissions for the \"WebSphere\" folder are set to \"770\" for the WebSphere user, group, and other. Permissions do not propagate to sub-folders.\r\n\r\nOn Windows systems, verify file permissions for \"WebSphere\" folder allow SYSTEM, WebSphere User and Admin Group full control. Permissions do not propagate to sub-folders.\r\n\r\nIf file permissions exceed these restrictions, this is a finding.","cciIds":["CCI-000162"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-95969r1_rule","stigId":"V-81255","groupId":"V-81255","title":"DPMS Target WebSphere AS 9.x","severity":"CAT II","description":"WebSphere uses role-based access controls to restrict access to log data. To take advantage of this capability, WebSphere administrators must identify specific users and place them into their respective roles. The auditor role is used for controlling access to logs.","fixText":"On the system hosting the WebSphere application server, log on to the operating system with admin rights.\r\n\r\nNavigate to the \"WebSphere\" folder, change permissions on the folder. Do not propagate permissions to sub-folders.\r\n\r\nFor UNIX systems: set \"WebSphere folder\" permissions to \"770\".\r\n\r\nFor Windows systems: set \"WebSphere folder\" permission to allow full control for SYSTEM, WebSphere user, and Admin Group. Do not propagate permissions to sub-folders.","checkText":"Review System Security Plan and the system documentation.\r\n\r\nIdentify the home folder and user account for the WebSphere installation.\r\n\r\nLog on to the operating system that is hosting the WebSphere application server. By default, WebSphere will be installed in the \"/opt/IBM/Websphere\" folder on UNIX like systems and in the \"C:\\Program Files\\IBM\\Websphere\\\" folder on Windows systems.\r\n\r\nOn UNIX systems, verify file permissions for the \"WebSphere\" folder are set to \"770\" for the WebSphere user, group and other. Permissions do not propagate to sub-folders.\r\n\r\nOn Windows systems, verify file permissions for \"WebSphere\" folder allow SYSTEM, WebSphere User, and Admin Group full control. Permissions do not propagate to sub-folders.\r\n\r\nIf file permissions exceed these restrictions, this is a finding.","cciIds":["CCI-000163"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-95971r1_rule","stigId":"V-81257","groupId":"V-81257","title":"DPMS Target WebSphere AS 9.x","severity":"CAT II","description":"WebSphere uses role based access controls to restrict access to log data. To take advantage of this capability, WebSphere administrators must identify specific users and place them into their respective roles. The auditor role is used for controlling access to logs.","fixText":"On the system hosting the WebSphere application server, log on to the operating system with admin rights.\r\n\r\nNavigate to the WebSphere folder, change permissions on the folder. Do not propagate permissions to sub-folders.\r\n\r\nFor UNIX systems: set \"WebSphere\" folder permissions to \"770\".\r\n\r\nFor Windows systems: set \"WebSphere\" folder permission to allow full control for SYSTEM, WebSphere user, and Admin Group. Do not propagate permissions to sub-folders.","checkText":"Review System Security Plan and the system documentation.\r\n\r\nIdentify the home folder and user account for the WebSphere installation.\r\n\r\nLog on to the operating system that is hosting the WebSphere application server. By default, WebSphere will be installed in the \"/opt/IBM/Websphere\" folder on UNIX like systems and in the \"C:\\Program Files\\IBM\\Websphere\\\" folder on Windows systems.\r\n\r\nOn UNIX systems, verify file permissions for the \"WebSphere\" folder are set to \"770\" for the WebSphere user, group, and other. Permissions do not propagate to sub-folders.\r\n\r\nOn Windows systems, verify file permissions for \"WebSphere\" folder allow SYSTEM, WebSphere User and Admin Group full control. Permissions do not propagate to sub-folders.\r\n\r\nIf file permissions exceed these restrictions, this is a finding.","cciIds":["CCI-000164"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-95973r1_rule","stigId":"V-81259","groupId":"V-81259","title":"DPMS Target WebSphere AS 9.x","severity":"CAT II","description":"Protecting log data also includes identifying and protecting the tools used to view and manipulate log data. Depending upon the log format and application, system and application log tools may provide the only means to manipulate and manage application and system log data. It is, therefore, imperative that access to log tools be controlled and protected from unauthorized access. Application servers provide a web- and/or a command line-based management functionality for managing the application server log capabilities. In addition, subsets of log tool components may be stored on the file system as jar or xml configuration files. The application server must ensure that in addition to protecting any web-based log tools, any file system-based tools are protected as well.","fixText":"On the system hosting the WebSphere application server, log on to the operating system with admin rights.\r\n\r\nNavigate to the \"WebSphere\" folder, and change permissions on the folder. Do not propagate permissions to sub-folders.\r\n\r\nFor UNIX systems: set the \"WebSphere\" folder permissions to \"770\".\r\n\r\nFor Windows systems: set the \"WebSphere\" folder permission to allow full control for SYSTEM, WebSphere user, and Admin Group. Do not propagate permissions to sub-folders.","checkText":"Review System Security Plan and the system documentation.\r\n\r\nIdentify the home folder and user account for the WebSphere installation.\r\n\r\nLog on to the operating system that is hosting the WebSphere application server. By default, WebSphere will be installed in the \"/opt/IBM/Websphere\" folder on UNIX like systems and in the \"C:\\Program Files\\IBM\\Websphere\\\" folder on Windows systems.\r\n\r\nOn UNIX systems, verify file permissions for the \"WebSphere\" folder are set to \"770\" for the WebSphere user, group, and other. Permissions do not propagate to sub-folders.\r\n\r\nOn Windows systems, verify file permissions for \"WebSphere\" folder allow SYSTEM, WebSphere User, and Admin Group full control. Permissions do not propagate to sub-folders.\r\n\r\nIf file permissions exceed these restrictions, this is a finding.","cciIds":["CCI-001493"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-95975r1_rule","stigId":"V-81261","groupId":"V-81261","title":"DPMS Target WebSphere AS 9.x","severity":"CAT II","description":"Protecting log data also includes identifying and protecting the tools used to view and manipulate log data. Depending upon the log format and application, system and application log tools may provide the only means to manipulate and manage application and system log data. It is, therefore, imperative that access to log tools be controlled and protected from unauthorized modification. If an attacker were to modify log tools, he could also manipulate logs to hide evidence of malicious activity. Application servers provide a web- and/or a command line-based management functionality for managing the application server log capabilities. In addition, subsets of log tool components may be stored on the file system as jar or xml configuration files. The application server must ensure that in addition to protecting any web-based log tools, any file system-based tools are protected as well.","fixText":"On the system hosting the WebSphere Application Server, log on to the operating system with admin rights.\r\n\r\nNavigate to the \"WebSphere\" folder.\r\n\r\nChange the permissions on the folder. Do not propagate permissions to sub-folders.\r\n\r\nFor UNIX systems: set the \"WebSphere\" folder permissions to \"770\".\r\n\r\nFor Windows systems: set the \"WebSphere\" folder permission to allow full control for SYSTEM, WebSphere user, and Admin Group. Do not propagate permissions to sub-folders.","checkText":"Review System Security Plan and the system documentation.\r\n\r\nIdentify the home folder and user account for the WebSphere installation.\r\n\r\nLog on to the operating system that is hosting the WebSphere application server. By default, WebSphere will be installed in the \"/opt/IBM/Websphere\" folder on UNIX like systems and in the \"C:\\Program Files\\IBM\\Websphere\\\" folder on Windows systems.\r\n\r\nOn UNIX systems, verify file permissions for the \"WebSphere\" folder are set to \"770\" for the WebSphere user, group, and other. Permissions do not propagate to sub-folders.\r\n\r\nOn Windows systems, verify file permissions for \"WebSphere\" folder allow SYSTEM, WebSphere User, and Admin Group full control. Permissions do not propagate to sub-folders.\r\n\r\nIf file permissions exceed these restrictions, this is a finding.","cciIds":["CCI-001494"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-95977r1_rule","stigId":"V-81263","groupId":"V-81263","title":"DPMS Target WebSphere AS 9.x","severity":"CAT II","description":"Protecting log data also includes identifying and protecting the tools used to view and manipulate log data. Depending upon the log format and application, system and application log tools may provide the only means to manipulate and manage application and system log data. It is, therefore, imperative that access to log tools be controlled and protected from unauthorized modification. If an attacker were to delete log tools, the application server administrator would have no way of managing or viewing the logs. Application servers provide a web- and/or a command line-based management functionality for managing the application server log capabilities. In addition, subsets of log tool components may be stored on the file system as jar, class, or xml configuration files. The application server must ensure that in addition to protecting any web-based log tools, any file system-based tools are protected from unauthorized deletion as well.","fixText":"On the system hosting the WebSphere application server, log on to the operating system with admin rights.\r\n\r\nNavigate to the \"WebSphere\" folder, change permissions on the folder. Do not propagate permissions to sub-folders.\r\n\r\nFor UNIX systems: set the \"WebSphere\" folder permissions to \"770\".\r\n\r\nFor Windows systems: set \"WebSphere\" folder permission to allow full control for SYSTEM, WebSphere user, and Admin Group. Do not propagate permissions to sub-folders.","checkText":"Review system documentation and security plan.\r\n\r\nIdentify the home folder and user account for the WebSphere installation.\r\n\r\nLog on to the operating system that is hosting the WebSphere application server. By default, WebSphere will be installed in the \"/opt/IBM/Websphere\" folder on UNIX like systems and in the \"C:\\Program Files\\IBM\\Websphere\\\" folder on Windows systems.\r\n\r\nOn UNIX systems, verify file permissions for the \"WebSphere\" folder are set to \"770\" for the WebSphere user, group, and other. Permissions do not propagate to sub-folders.\r\n\r\nOn Windows systems, verify file permissions for WebSphere folder allow SYSTEM, WebSphere User, and Admin Group full control. Permissions do not propagate to sub-folders.\r\n\r\nIf file permissions exceed these restrictions, this is a finding.","cciIds":["CCI-001495"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-95979r1_rule","stigId":"V-81265","groupId":"V-81265","title":"DPMS Target WebSphere AS 9.x","severity":"CAT II","description":"Protection of log records is of critical importance. Encrypting log records provides a level of protection that does not rely on host-based protections that can be accidentally misconfigured, such as file system permissions. Cryptographic mechanisms are the industry-established standard used to protect the integrity of log data. An example of a cryptographic mechanism is the computation and application of a cryptographic-signed hash using asymmetric cryptography. Encryption of log records must be tempered with architecture designs that incorporate log data into SIEM systems that read and act upon log data. Some SIEM systems may not be able to decrypt encrypted log data so encrypting the logs could be detrimental to the incident response process. This must be taken into account and addressed in the security plan.","fixText":"From the administrative console, click Security >> Security Auditing >> Audit record encryption configuration.\r\n\r\nSelect the \"Enable encryption\" checkbox.\r\n\r\nSelect the keystore that contains the encrypting certificate from the drop-down menu or click \"New\" to create a new keystore.\r\n\r\nIf you are using an existing certificate to encrypt your audit records, ensure the Certificate in the keystore is selected and specify the intended certificate in the \"Certificate alias\" drop-down menu.\r\n\r\nIf you are generating a new certificate to encrypt your audit records, do NOT use the \"Create a new certificate in the selected keystore\" option, this will generate a SHA-1 signed certificate, which is not allowed.\r\n\r\nInstead, select Security >> SSL Certificate and key management >> KeyStores and Certificates.\r\n\r\nSelect the keystore that is associated with the server hosting the audit logs.\r\n\r\nSelect \"Personal Certificates\".\r\n\r\nSelect \"Create\".\r\n\r\nSelect either a CA-Signed or Chained Certificate based on your requirements.\r\n\r\nFill in the information required to generate the certificate.\r\n\r\nRestart the DMGR and all the JVMs.","checkText":"Review System Security Plan documentation.\r\n\r\nIf the System Security Plan does not specify the encryption of audit records, this requirement is NA.\r\n\r\nFrom the administrative console, click Security >> Security Auditing >> Audit record encryption configuration.\r\n\r\nIf the \"Enable encryption\" check box is not selected, this is a finding.","cciIds":["CCI-001350"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-95981r1_rule","stigId":"V-81267","groupId":"V-81267","title":"DPMS Target WebSphere AS 9.x","severity":"CAT II","description":"Protection of log records is of critical importance. Encrypting log records provides a level of protection that does not rely on host-based protections that can be accidentally misconfigured, such as file system permissions. Cryptographic mechanisms are the industry-established standard used to protect the integrity of log data. An example of a cryptographic mechanism is the computation and application of a cryptographic-signed hash using asymmetric cryptography.","fixText":"From the administrative console, click Security >> Security Auditing >> Audit record signing configuration.\r\n\r\nSelect the \"Enable signing\" checkbox.\r\n\r\nSelect the keystore that contains the encrypting certificate from the drop-down menu.\r\n\r\nIf you are using an existing certificate to sign your audit records, ensure the Certificate in keystore is selected and specify the intended certificate in the \"Certificate alias\" drop-down menu.\r\n\r\nIf you are generating a new certificate to sign your audit records, do NOT use the \"Create a new certificate in the selected keystore\" option, this will generate a SHA-1 signed certificate, which is not allowed.\r\n\r\nInstead, select Security >> SSL Certificate and key management >> KeyStores and Certificates.\r\n\r\nSelect the keystore that is associated with the server hosting the audit logs.\r\n\r\nSelect \"Personal Certificates\".\r\n\r\nSelect \"Create\".\r\n\r\nSelect either a CA-Signed or Chained Certificate based on your requirements.\r\n\r\nFill in the information required to generate the certificate.\r\n\r\nRestart the DMGR and all the JVMs.","checkText":"From the administrative console, click Security >> Security Auditing >> Audit record signing configuration.\r\n\r\nIf the \"Enable signing\" checkbox is not selected, this is a finding.","cciIds":["CCI-001350"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-95983r1_rule","stigId":"V-81269","groupId":"V-81269","title":"DPMS Target WebSphere AS 9.x","severity":"CAT II","description":"The use of the -password option to launch a WebSphere process from the command line can result in a security exposure. Password information may become visible to any user with the ability to view system processes. For example, on a Linux system the \"ps\" command will display all running processes, which would include all of the command line flags used to start a WebSphere process.","fixText":"When starting WebSphere commands, such as wsadmin, stopManager, stopNode, stopServer, or syncNode; do not use the \"-password <password>\" option.\r\n\r\nUse the interactive mode instead; you will be prompted for user id and password.\r\n\r\nFor scripts, you may configure user id and password in the \"connector properties\" files. These files are under \"Profile_Root/Properties\" folder.\r\n\r\n- soap.client.props: for default SOAP\r\n- sas.client.props : for RMI and JSR160RMI connectors\r\n- ipc.client.props: for IPC connector","checkText":"Review System Security Plan documentation.\r\n\r\nInterview the system administrator.\r\n\r\nAccess operating system to list commands currently running.\r\n\r\nFor UNIX: run \"ps -ef | grep -i wsadmin.sh\"\r\n\r\nFor windows: from a DOS prompt as admin user run \"WMIC path win32_process where \"caption='wsadmin.exe'\" get CommandLine\"\r\n\r\nIf the results show \"wsadmin.sh(exe) -user <username> -password <password>\", this is a finding.","cciIds":["CCI-000381"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-95985r1_rule","stigId":"V-81271","groupId":"V-81271","title":"DPMS Target WebSphere AS 9.x","severity":"CAT II","description":"Having files owned by the root or administrator user is an indication that the WebSphere processes are being run with escalated privileges. Running as root/admin user gives attackers elevated privileges that can be used to compromise the system more easily compared to operating the WebSphere processes with regular user privileges. Specifying a regular OS user when installing and managing WebSphere is best practice. By doing so, the WebSphere files will be owned by the user ID specified rather than being owned by the admin user. Use the underlying OS file permissions to ensure that access to the WebSphere files are restricted to only those users who require access.","fixText":"Note: executing this fix without proper planning regarding file ownership can render your installation inoperable. See vulnerability discussion before executing this fix.\r\n\r\nEnsure all WebSphere related files and folders are owned by the WebSphere OS user.\r\n\r\nEnsure OS group membership is restricted.\r\n\r\nFile ownership changes for UNIX systems:\r\nchown -R <user> <WAS_HOME>\r\nchown -R <user> <PROFILE_HOME>, \r\nchown -R <user> <OTHER_HOME>, <OTHER_HOME> may be zero or more directories for other files\r\n\r\nGroup ownership changes for UNIX systems:\r\nchgrp -R <user> <WAS_HOME>\r\nchgrp -R <user> <PROFILE_HOME>,\r\nchgrp -R <user> <OTHER_HOME>, where <OTHER_HOME> may be zero or more root directories for other files\r\n\r\nFile ownership changes for Windows systems:\r\n\"takeown /r /u <user> /f <directory /p <password of user>\", where the <directory> is <WAS_HOME>, <PROFILE_HOME>, or <OTHER_HOME>","checkText":"Review System Security Plan documentation.\r\n\r\nInterview the system administrator.\r\n\r\nDetermine the OS user and group information associated with the WebSphere processes.\r\n\r\nIdentify the paths, files, and folders associated with the WebSphere installation.\r\n\r\nThese include:\r\n- <WAS_HOME>: where you installed WebSphere. \r\n\r\n<WAS_HOME> default location:\r\n\r\nFor UNIX: /opt/IBM/WebSphere/AppServer\r\nFor Windows: C:\\Program Files\\IBM\\WebSphere\\AppServer\r\n\r\n- <PROFILE_HOME>: where the appserver instance resides. The default location is under \"<WAS_HOME>/profiles\".\r\n\r\n- <OTHER_HOME>: any additional files that may reside outside of <WAS_HOME>. Examples include:\r\n- shared library .jar files\r\n- Resource Adapter .rar files\r\n- Key and trust store files (.jks and .p12)\r\n- Other files such as jdbc drivers\r\n\r\nFor Linux, use the command \"find <directory> -user root\" to find files owned by root user.\r\n\r\nOn windows use the \"dir /Q /S\" command from the root directories to show the owners of all files.\r\n\r\nExamine the output for files owned by the administrator or root account.\r\n\r\nIf any WebSphere file or additional files as described above are owned by root or the administrator, this is a finding.","cciIds":["CCI-000381"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-95987r1_rule","stigId":"V-81273","groupId":"V-81273","title":"DPMS Target WebSphere AS 9.x","severity":"CAT III","description":"WebSphere samples are not intended for use in a production environment. Do not run them there, as they create significant security risks. In particular, the snoop servlet can provide an outsider with tremendous amounts of information about your system. This is precisely the type of information you do not want to give a potential intruder. Do not install the samples during the profile creation or uninstall the sample programs.","fixText":"Navigate to Applications >> All Applications.\r\n\r\nClick on the corresponding application checkbox.\r\n\r\nSelect \"Remove\".\r\n\r\nClick \"OK\".\r\n\r\nClick \"Save\".","checkText":"Navigate to Applications >> All Applications.\r\n\r\nReview all applications installed on the application server.\r\n\r\nIf the sample applications snoop, ivt, or DefaultApplication are installed on a production system, this is a finding.","cciIds":["CCI-000381"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-95989r1_rule","stigId":"V-81275","groupId":"V-81275","title":"DPMS Target WebSphere AS 9.x","severity":"CAT III","description":"When you install IBM HTTP Server, the installer leaves behind a JRE. Remove this JRE, as it provides functions that are not needed by the Web server or plug-in under normal conditions. Keep in mind that this will make it impossible to run some tools such as ikeyman on this Web server. When you install the WebSphere Application Server HTTP Server plug-in using the IBM installer, it also leaves behind a JRE. Also, remove this JRE post install. Having a functioning JRE in the DMZ provides attackers who have breached into the DMZ with additional tools to carry out further attacks.","fixText":"For web servers provided with the WebSphere installation that are operating in the DMZ.\r\n\r\nRemove the /java directory from within the plugins folder.","checkText":"This check needs to be run on the web server operating in the DMZ.\r\n\r\nReview system documentation.\r\n\r\nIdentify web servers operating in DMZ.\r\n\r\nIf there are no web servers configured for the DMZ, this is not applicable.\r\n\r\nFrom the administrative console, select Server Types >> Web Servers.\r\n\r\nSelect each web server operating in the DMZ.\r\n\r\nIdentify the \"Web server installation location\". \r\n\r\nOpen a secured command shell to the web server in the DMZ.\r\n\r\nChange directory to the web server installation location.\r\n\r\nCD to the /plugins folder. \r\n\r\nIf a /java directory exists in the plugins folder, this is a finding.","cciIds":["CCI-000381"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-95991r1_rule","stigId":"V-81277","groupId":"V-81277","title":"DPMS Target WebSphere AS 9.x","severity":"CAT II","description":"Running WebSphere as an admin user gives attackers immediate admin privileges in the event the WebSphere processes are compromised. Best practice is to operate the WebSphere server with an account that has limited OS privileges. To configure system startup: https://www.ibm.com/support/knowledgecenter/en/SSAW57_8.5.5/com.ibm.websphere.nd.multiplatform.doc/ae/trun_processrestart.html","fixText":"Ensure that WAS processes are started via the specified non-privileged OS user ID when running commands such as startManager, startNode, and startServer.\r\n\r\nIf startManager and startNode are in the system startup scripts, ensure that they are not started as the root user or admin user for Windows systems. \r\n\r\nFor example, in the UNIX system, the inittab entry may look like: \"was:235:respawn:/usr/WebSphere/AppServer/bin/rc.was >/dev/console 2>&1\".\r\n\r\nEnsure the user is not a root user and is instead a regular OS user.","checkText":"Interview systems manager.\r\n\r\nIdentify the OS user ID that the WAS server runs as.\r\n\r\nUsing relevant OS commands review OS processes and search for WAS processes (running as Java).\r\n\r\nEnsure they are running under the assigned non-administrative user id.\r\n\r\nFor UNIX: \"ps -ef|grep -i websphere\"\r\n\r\nFor Windows: \"wmic path win32_process where \"caption = 'java.exe'\" get CommandLine\r\n\r\nIf the WebSphere processes are running as the root or administrator user, this is a finding.","cciIds":["CCI-000381"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-95993r1_rule","stigId":"V-81279","groupId":"V-81279","title":"DPMS Target WebSphere AS 9.x","severity":"CAT II","description":"Application servers provide a myriad of differing processes, features, and functionalities. Some of these processes may be deemed to be unnecessary or too unsecure to run on a production DoD system. Application servers must provide the capability to disable or deactivate functionality and services that are deemed to be non-essential to the server mission or can adversely impact server performance, for example, disabling dynamic JSP reloading on production application servers as a best practice.","fixText":"To disable JSP reloading:\r\n\r\nFrom the admin console, navigate to: Applications >> All applications >> [application name] >> JSP and JSP options.\r\n\r\nUncheck \"JSP enable class reloading\".","checkText":"From admin console, navigate to: Applications >> All applications >> [application name] >> JSP and JSP options.\r\n\r\nIf \"JSP enable class reloading\" is checked, this is a finding.","cciIds":["CCI-000381"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-96007r1_rule","stigId":"V-81293","groupId":"V-81293","title":"DPMS Target WebSphere AS 9.x","severity":"CAT II","description":"Some networking protocols may not meet organizational security requirements to protect data and components. Application servers natively host a number of various features, such as management interfaces, httpd servers, and message queues. These features all run on TCPIP ports. This creates the potential that the vendor may choose to utilize port numbers or network services that have been deemed unusable by the organization. The application server must have the capability to both reconfigure and disable the assigned ports without adversely impacting application server operation capabilities. For a list of approved ports and protocols, reference the DoD ports and protocols website at https://powhatan.iiie.disa.mil/ports/cal.html.","fixText":"Ensure all available ports are registered with PPSM.","checkText":"In the administrative console, click Servers >> All Servers.\r\n\r\nSelect each [server_name].\r\n\r\nSelect >> Ports.\r\n\r\nConfirm server ports are registered with PPSM.\r\n\r\nNavigate to System Administration >> Deployment Manager >> Ports.\r\n\r\nConfirm ports are registered with PPSM.\r\n\r\nNavigate to System Administration >> node agents.\r\n\r\nFor each [node agent], select >> Ports.\r\n\r\nConfirm ports are registered with PPSM.\r\n\r\nIf any of available ports are not registered with PPSM, or if those ports to be connected through the firewall are not approved by PPSM, this is a finding.","cciIds":["CCI-000382"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-96013r1_rule","stigId":"V-81299","groupId":"V-81299","title":"DPMS Target WebSphere AS 9.x","severity":"CAT II","description":"To assure accountability and prevent unauthorized access, application server users must be uniquely identified and authenticated. This is typically accomplished via the use of a user store which is either local (OS-based) or centralized (LDAP) in nature. To ensure support to the enterprise, the authentication must utilize an enterprise solution.","fixText":"In the administrative console, click Security >> Global security.\r\n\r\nUnder \"User account repository\", click the \"Available realm definitions\" drop-down list.\r\n\r\nSelect \"Standalone LDAP\" registry.\r\n\r\nClick \"Configure\".\r\n\r\nProvide the Primary Administrative user name, type of LDAP server, hostname for the LDAP server, define the Base distinguished name.\r\n\r\nClick \"OK\".\r\n\r\nOn \"Global security\" panel, click \"Set as current\".\r\n\r\nClick \"Apply\".\r\n\r\nClick \"Save\".\r\n\r\nRecycle and synchronize the JVMS.","checkText":"In the administrative console, click Security >> Global security.\r\n\r\nIf the \"Available realm definitions\" drop down box under the \"User account repository\" section is not set to \"Standalone LDAP registry\", this is a finding.","cciIds":["CCI-000764"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-96019r1_rule","stigId":"V-81305","groupId":"V-81305","title":"DPMS Target WebSphere AS 9.x","severity":"CAT II","description":"WebSphere does not provide direct audit of changes to the built-in file registry. The built-in file registry must not be used to support user logon accounts. Use an LDAP/AD server and manage user accounts centrally.","fixText":"Navigate to Security >> Global Security.\r\n\r\nUnder \"User Account Repository\", select \"Stand alone LDAP\" from the \"Available realm definitions\" drop-down.\r\n\r\nClick on \"Configure\".\r\n\r\nSelect an existing user from the LDAP directory to be the primary WebSphere admin user.\r\n\r\nIdentify the type of LDAP server; specify an IP or DNS name for the LDAP Server, and the port used to connect to the LDAP server.\r\n\r\nSpecify BASE DN.\r\n\r\nSpecify the BIND DN.\r\n\r\nSpecify the BIND Password.\r\n\r\nSelect the \"SSL enabled\" check box to use secure LDAP.\r\n\r\nClick \"Apply\".\r\n\r\nClick \"Save\".\r\n\r\nGo to Global Security.\r\n\r\nSelect \"Standalone LDAP registry\" from the \"Available realm definitions\" drop-down.\r\n\r\nClick \"Set as current\".\r\n\r\nClick \"Apply\".\r\n\r\nClick \"Save\".\r\n\r\nRestart the dmgr and synchronize the JVMs.","checkText":"Navigate to Security >> Global Security.\r\n\r\nUnder \"User Account Repository\" if the \"Federated Repositories\" is chosen, click on \"Configure\".\r\n\r\nUnder \"Repositories in the realm\", if \"o=defaultWIMFileBasedRealm\" appears in the \"Base Entry\" column, this is a finding.","cciIds":["CCI-000764"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-96025r1_rule","stigId":"V-81311","groupId":"V-81311","title":"DPMS Target WebSphere AS 9.x","severity":"CAT II","description":"Multifactor authentication creates a layered defense and makes it more difficult for an unauthorized person to access the application server. If one factor is compromised or broken, the attacker still has at least one more barrier to breach before successfully breaking into the target. Unlike a simple username/password scenario where the attacker could gain access by knowing both the username and password without the user knowing his account was compromised, multifactor authentication adds the requirement that the attacker must have something from the user, such as a token, or to biometrically be the user. Multifactor authentication is defined as: using two or more factors to achieve authentication. Factors include: (i) something a user knows (e.g., password/PIN); (ii) something a user has (e.g., cryptographic identification device, token); or (iii) something a user is (e.g., biometric). A CAC or PKI Hardware Token meets this definition. A privileged account is defined as an information system account with authorizations of a privileged user. These accounts would be capable of accessing the web management interface. When accessing the application server via a network connection, administrative access to the application server must be PKI Hardware Token enabled. Satisfies: SRG-APP-000149-AS-000102, SRG-APP-000391-AS-000239, SRG-APP-000392-AS-000240, SRG-APP-000151-AS-000103, SRG-APP-000177-AS-000126, SRG-APP-000402-AS-000247, SRG-APP-000403-AS-000248, SRG-APP-000404-AS-000249, SRG-APP-000219-AS-000147","fixText":"From the admin console, select System Administration >> Deployment Manager >> Java and Process Management >> Process definition >> Java Virtual Machine >> Custom Properties.\r\n\r\nSelect \"New\".\r\n\r\nInsert the following case sensitive value into the \"Name\" field: \"adminconsole.certLogin\".\r\n\r\nSelect \"Value\".\r\n\r\nEnter \"true\".\r\n\r\nClick \"Apply\".\r\n\r\nClick \"Save\".\r\n\r\nSelect Security >> SSL Certificate and Key management >> SSL Configurations >> Select CellDefaultSSLSettings >> Quality of Protection (QOP) settings.\r\n\r\nIn the \"Client Authentication\" drop-box, make sure \"Supported\" or \"Required\" is selected. \r\n\r\nClick \"Apply\".\r\n\r\nClick \"Save\".\r\n\r\nSave a backup copy and edit the \"Web.xml\" file as follows: <WAS_INSTALL>/profiles/<profileName>/config/cells/<cellName>/applications/isclite.ear/deployments/isclite/isclite.war/WEB-INF/web.xml:\r\n--- Change: \r\n< security-constraint>\r\n<web-resource-collection>\r\n<web-resource-name>Protected Area</web-resource-name>\r\n<url-pattern>/</url-pattern>\r\n--- So it becomes:\r\n< security-constraint>\r\n<web-resource-collection>\r\n<web-resource-name>Protected Area</web-resource-name>\r\n<url-pattern>/</url-pattern>\r\n<url-pattern>/logon.jsp</url-pattern>\r\n<url-pattern>/logonError.jsp</url-pattern>\r\n--- Add these security constraints if not already present:\r\n<security-constraint>\r\n<web-resource-collection>\r\n<web-resource-name>free pages</web-resource-name>\r\n<url-pattern>/*.jsp</url-pattern>\r\n<url-pattern>/css/*</url-pattern>\r\n<url-pattern>/images/*</url-pattern>\r\n<url-pattern>/j_security_check</url-pattern>\r\n</web-resource-collection>\r\n</security-constraint> \r\n--- Change:\r\n<auth-method>FORM</auth-method>\r\nto\r\n<auth-method>CLIENT-CERT</auth-method>\r\n\r\nSave the \"web.xml\" file.\r\n\r\nStop and restart the Deployment Manager. \r\n\r\nLog on to the admin console using your certificate.","checkText":"Check that the admin console is enabled for client certificate logon.\r\n\r\nIn the Deployment Manager, check the file on: <WAS_INSTALL>/profiles/<profileName>/config/cells/<cellName>/applications/isclite.ear/deployments/isclite/isclite.war/WEB-INF/web.xml.\r\n\r\nIf the \"XML element <auth-method>FORM</auth-method>\" is present, this is a finding.","cciIds":["CCI-000187","CCI-000765","CCI-000767","CCI-001184","CCI-001953","CCI-001954","CCI-002009","CCI-002010","CCI-002011"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-96039r1_rule","stigId":"V-81325","groupId":"V-81325","title":"DPMS Target WebSphere AS 9.x","severity":"CAT II","description":"Application servers may provide a web services capability that could be leveraged to allow remote access to sensitive application data. A web service which is a repeatable process used to make data available to remote clients, should not be confused with a web server. Many web services utilize SOAP, which in turn utilizes XML and HTTP as a transport. Natively, SOAP does not provide security protections. As such, the application server must provide security extensions to enhance SOAP capabilities to ensure that secure authentication mechanisms are employed to protect sensitive data. The WS_Security suite is a widely used and acceptable SOAP security extension.","fixText":"To attach policy sets for your service providers: \r\nFrom admin console, navigate to Applications >> All applications >> [application]. \r\n\r\nFor each application that is a web service provider and requires secure authentication, click on \"Service provider policy sets and bindings.\"\r\n\r\nClick button on the \"Select\" column to select a resource. \r\n\r\nClick on \"Attach Policy Set\" drop down.\r\n\r\nSelect policy set that best matches the provider environment.\r\n\r\nClick button on the \"Select\" column to select the same resource.\r\n\r\nClick on the \"Assign binding\" drop down.\r\n\r\nSelect a binding that best matches the environment.\r\n\r\nClick \"Save\".\r\n\r\nRestart DMGR and resync the JVMs.","checkText":"Review System Security Plan documentation.\r\n\r\nInterview the system administrator.\r\n\r\nIdentify any application web service providers and the secure authentication requirements for each service provider. \r\n\r\nFrom admin console, navigate to Applications >> All applications.\r\n\r\nClick on each application that is a web service provider where the security plan specifies security extensions are to be applied. \r\n\r\nNavigate to \"Service provider policy sets and bindings\".\r\n\r\nVerify that any web service providers that are required to have security extensions applied as per the security plan have a policy attached.\r\n\r\nIf \"Attached policy set\" column displays none, but the System Security Plan specifies security extensions as required, this is a finding.","cciIds":["CCI-001941"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-96043r1_rule","stigId":"V-81329","groupId":"V-81329","title":"DPMS Target WebSphere AS 9.x","severity":"CAT II","description":"Application servers may provide a web services capability that could be leveraged to allow remote access to sensitive application data. A web service, which is a repeatable process used to make data available to remote clients, should not be confused with a web server. Many web services utilize SOAP, which in turn utilizes XML and HTTP as a transport. Natively, SOAP does not provide security protections. As such, the application server must provide security extensions to enhance SOAP capabilities to ensure that secure authentication mechanisms are employed to protect sensitive data. The WS_Security suite is a widely used and acceptable SOAP security extension.","fixText":"To attach policy sets for your service clients: \r\nFrom admin console, navigate to Applications >> All applications >> [application]. \r\n\r\nFor each application that is a web service client and requires secure authentication, click on \"Service client policy sets and bindings.\"\r\n\r\nClick button on the \"Select\" column to select a resource. \r\n\r\nClick on \"Attach Client Policy Set\" drop down.\r\n\r\nSelect policy set that best matches the environment.\r\n\r\nClick button on the \"Select\" column to select the same resource.\r\n\r\nClick on the \"Assign binding\" drop down.\r\n\r\nSelect a binding that best matches the environment.\r\n\r\nClick \"Save\".\r\n\r\nRestart DMGR and resync the JVMs.","checkText":"Review System Security Plan documentation.\r\n\r\nInterview the system administrator.\r\n\r\nIdentify any application web service clients.\r\n\r\nIdentify the secure authentication requirements for each client.\r\n\r\nFrom admin console, navigate to Applications >> All applications.\r\n\r\nClick on each application that is a web service client where the security plan specifies security extensions are to be applied.\r\n\r\nNavigate to \"Service client policy sets and bindings\".\r\n\r\nVerify that any web service clients that are required to have security extensions applied as per the security plan have a policy attached.\r\n\r\nIf \"Attached policy set\" column displays none, but the System Security Plan specifies security extensions as required, this is a finding.","cciIds":["CCI-001941"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-96047r1_rule","stigId":"V-81333","groupId":"V-81333","title":"DPMS Target WebSphere AS 9.x","severity":"CAT II","description":"Device authentication requires unique identification and authentication that may be defined by type, by specific device, or by a combination of type and device. Device authentication is accomplished via the use of certificates and protocols such as SSL mutual authentication. Device authentication is performed when the application server is providing web services capabilities and data protection requirements mandate the need to establish the identity of the connecting device before the connection is established. Note: with LDAP registry, the entire DN in the certificate is used to look up LDAP. Filters may be configured. With other registries, only the first attribute after the first \"=\", e.g., CN= is used. https://www.ibm.com/support/knowledgecenter/prodconn_1.0.0/com.ibm.scenarios.wmqwassecure.doc/topics/implementing.htm?cp=SSEQTP_8.0.0 Satisfies: SRG-APP-000394-AS-000241, SRG-APP-000177-AS-000126","fixText":"From the admin console, navigate to Security >> SSL Certificate and Key Management >> SSL Configuration.\r\n\r\nFor each [NodeDefaultSSLSettings] select Quality of Protection (QoP) Settings.\r\n\r\nSet \"Client authentication\" according to the security plan.","checkText":"Review System Security Plan documentation.\r\n\r\nIdentify mutual authentication connection requirements.\r\n\r\nFrom the admin console, navigate to Security >> SSL Certificate and Key Management >> SSL Configuration.\r\n\r\nSelect each [NodeDefaultSSLSettings] then go to Quality of Protection (QoP) Settings.\r\n\r\nIf \"Client authentication\" is not set according to the security plan, this is a finding.","cciIds":["CCI-000187","CCI-001958"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-96055r1_rule","stigId":"V-81341","groupId":"V-81341","title":"DPMS Target WebSphere AS 9.x","severity":"CAT II","description":"Device authentication requires unique identification and authentication that may be defined by type, by specific device, or by a combination of type and device. Bidirectional authentication provides stronger safeguards to validate the identity of other devices for connections that are of greater risk. Device authentication is performed when the application server is providing web services capabilities and data protection requirements mandate the need to establish the identity of the connecting device before the connection is established. Because of the challenges of applying this requirement on a large scale, organizations are encouraged to only apply the requirement to those limited number (and type) of devices that truly need to support this capability. Note: with LDAP registry, the entire DN in the certificate is used to look up LDAP. Filters may be configured. With other registries, only the first attribute after the first \"=\", e.g., CN= is used.","fixText":"From the admin console, navigate to Security >> SSL Certificate and Key Management >> SSL Configuration.\r\n\r\nFor each [NodeDefaultSSLSettings] select Quality of Protection (QoP) Settings.\r\n\r\nSet \"Client authentication\" according to the security plan.","checkText":"Review System Security Plan documentation.\r\n\r\nIdentify mutual authentication connection requirements.\r\n\r\nFrom the admin console, navigate to Security >> SSL Certificate and Key Management >> SSL Configuration.\r\n\r\nSelect each [NodeDefaultSSLSettings] then go to Quality of Protection (QoP) Settings.\r\n\r\nIf \"Client authentication\" is not set according to the security plan, this is a finding.\r\n\r\nNote: with LDAP registry, the entire DN in the certificate is used to look up LDAP. Filters may be configured. With other registries, only the first attribute after the first \"=\", e.g., CN=<user> is used.","cciIds":["CCI-001967"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-96057r1_rule","stigId":"V-81343","groupId":"V-81343","title":"DPMS Target WebSphere AS 9.x","severity":"CAT I","description":"By default, all administrative and user applications in WebSphere® Application Server use the global security configuration. For example, a user registry defined in global security is used to authenticate users for every application in the cell. WebSphere allows for additional WebSphere security domains where different security attributes for some or all of your user applications can be set. These domains must also be configured to use application security.","fixText":"Navigate to security >> security domains.\r\n\r\nClick through each security domain.\r\n\r\nIf \"Customize for this domain\" is checked for Application Security under the Security Attributes, but \"Enable application security\" is not checked, check \"Enable application security\".\r\n\r\nExpand \"show\" to find all affected nodes and servers.\r\n\r\nClick \"OK\".\r\n\r\nClick \"Save\".\r\n\r\nSynchronize the changes.\r\n\r\nRestart all affected nodes and servers.","checkText":"Review System Security Plan documentation.\r\n\r\nIdentify any publicly available applications. These are applications available to the public that do not require authentication to access (e.g., recruiting websites).\r\n\r\nIf such applications exist on the system and are specifically allowed according to the security plan, this requirement is NA for those applications only.\r\n\r\nNavigate to security >> security domains.\r\n\r\nClick through each security domain.\r\n\r\nIf \"Customize for this domain\" is checked for Application Security under the Security Attributes, but \"Enable application security\" is not checked, this is a finding.","cciIds":["CCI-000197"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-96061r1_rule","stigId":"V-81347","groupId":"V-81347","title":"DPMS Target WebSphere AS 9.x","severity":"CAT I","description":"Passwords need to be protected at all times, and encryption is the standard method for protecting passwords during transmission. Application servers have the capability to utilize LDAP directories for authentication. If LDAP connections are not protected during transmission, sensitive authentication credentials can be stolen. When the application server utilizes LDAP, the LDAP traffic must be encrypted. To ensure an error-free operation for this step, first extract to a file the Signer certificate of the LDAP and send that file to the WebSphere Application Server machine. Then add the certificate to the truststore being defined for the LDAP. In this way, you are assured that the remaining actions for this step will be successful. Satisfies: SRG-APP-000172-AS-000121, SRG-APP-000172-AS-000120","fixText":"In the administrative console, click Security >> Global security.\r\n\r\nUnder User account repository, click the \"Available realm definitions\" drop-down list.\r\n\r\nSelect Standalone LDAP registry.\r\n\r\nClick \"Configure\".\r\n\r\nClick \"SSL enabled\".\r\n\r\nClick \"OK\".\r\n\r\nOn Global security panel, click \"Set as current\".\r\n\r\nClick \"Apply\".\r\n\r\nClick \"Save\".\r\n\r\nTo ensure an error-free operation for this step, you need to first extract to a file the Signer certificate of the LDAP and send that file to the WebSphere Application Server machine. You can then add the certificate to the trust store being defined for the LDAP. In this way, you are assured that the remaining actions for this step will be successful.","checkText":"In the administrative console, click Security >> Global security.\r\n\r\nUnder \"User account repository\", click \"Configure\" for the \"Standalone LDAP registry\", on \"Standalone LDAP registry\" panel.\r\n\r\nIf the \"SSL\" flag is not enabled, this is a finding.","cciIds":["CCI-000197"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-96065r1_rule","stigId":"V-81351","groupId":"V-81351","title":"DPMS Target WebSphere AS 9.x","severity":"CAT II","description":"When the application server is using PKI authentication, a local revocation cache must be stored for instances when the revocation cannot be authenticated through the network, but if cached authentication information is out of date, the validity of the authentication information may be questionable.","fixText":"From the admin console, navigate to Security >> Global Security >> Authentication.\r\n\r\nClick on \"Authentication cache\" settings.\r\n\r\nEnter the settings for \"Cache timeout\" in accordance with the parameters defined in the Systems Security Plan.","checkText":"Review System Security Plan documentation.\r\n\r\nIdentify the cache timeout parameters for authentication.\r\n\r\nStandard value for admin timeout is 10 minutes; however, the ISSO may allow a case by case exception based on operational requirements.\r\n\r\nFrom the admin console, navigate to Security >> Global Security >> Authentication cache settings.\r\n\r\nIf \"Enable authentication cache\" check box is set and \"Cache timeout\" is larger than the parameters specified in the security plan, this is a finding.","cciIds":["CCI-002007"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-96071r1_rule","stigId":"V-81357","groupId":"V-81357","title":"DPMS Target WebSphere AS 9.x","severity":"CAT I","description":"The cornerstone of the PKI is the private key used to encrypt or digitally sign information. If the private key is stolen, this will lead to the compromise of the authentication and non-repudiation gained through PKI because the attacker can use the private key to digitally sign documents and can pretend to be the authorized user. Both the holders of a digital certificate and the issuing authority must protect the computers, storage devices, or whatever they use to keep the private keys. Java-based application servers utilize the Java keystore, which provides storage for cryptographic keys and certificates. The keystore is usually maintained in a file stored on the file system.","fixText":"Navigate to Security >> SSL Certificate and Key Management >> Key stores and certificates.\r\n\r\nSelect a keystore from the list.\r\n\r\nClick \"Change Password\".\r\n\r\nEnter the new password and password confirmation.\r\n\r\nClick \"OK\".\r\n\r\nRepeat for every keystore in the list.\r\n\r\nSynchronize changes to all nodes.","checkText":"Review System Security Plan documentation.\r\n\r\nInterview the system administrator.\r\n\r\nIdentify installation folders and DMGR info.\r\n\r\nAccess the DMGR system via the OS.\r\n\r\nStop the DMGR processes. This will shut down the application server so plan outages accordingly. \r\n\r\nThe default file paths and DefaultMgr installation names are provided below, adjust paths, and dmgr name if your installation differs from the default.\r\n\r\nFor UNIX systems:\r\ncd /opt/IBM/Websphere/Profiles/<DefaultDmgr01>/logs/dmgr/\r\n\r\n-stopManager.sh -user [admin user name] - password [admin user password]\r\n-archive the SystemOut*.log files. (Copy to another location)\r\n-startManager.sh\r\n-grep -i cwpki0041w SystemOut.log\r\n\r\nFor Windows:\r\ncd C:\\program files\\IBM\\Websphere\\Profiles\\<DefaultDmgr01>\\logs\\dmgr\\\r\n\r\n-stopManager.exe -user [admin user name] - password [admin user password]\r\n-archive the SystemOut*.log files. (Copy to another location)\r\n-startManager.exe\r\n-findstr -I cwpki0041w systemout.log\r\n\r\nIf the results include: \r\n\"CWPKI0041W: One or more keystores are using the default password\", this is a finding.","cciIds":["CCI-000186"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-96075r1_rule","stigId":"V-81361","groupId":"V-81361","title":"DPMS Target WebSphere AS 9.x","severity":"CAT II","description":"The cornerstone of PKI is the private key used to encrypt or digitally sign information. The key by itself is a cryptographic value that does not contain specific user information, but the key can be mapped to a user. Without mapping the certificate used to authenticate to the user account, the ability to determine the identity of the individual user or group will not be available for forensic analysis. Application servers must provide the capability to utilize and meet requirements of the DoD Enterprise PKI infrastructure for application authentication.","fixText":"Obtain the signer certificate either as Base 64 encoded ASCII file, or as binary DER data.\r\n\r\nNavigate to Security >> SSl certificate and key management >> SSL Configurations >> CellDefaultSSLSettings >> key stores and certificates.\r\n\r\nClick on cell default trust store.\r\n\r\nClick on \"Signer Certificates\".\r\n\r\nClick \"Add\".\r\n\r\nEnter a new alias for the signer, and the location of the file that stores signer certificate.\r\n\r\nFor \"Data type\", choose the type appropriate for the file, either Base64-encoded ASCII data file, or binary DER data.\r\n\r\nClick \"OK\".","checkText":"Navigate to Security >> SSl certificate and key management >> SSL Configurations >> CellDefaultSSLSettings >> KeyStores and certificates.\r\n\r\nClick on cell default trust store.\r\n\r\nClick on \"Signer Certificates\".\r\n\r\nIf no DoD root or intermediate certificates are present, this is a finding.","cciIds":["CCI-000187"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-96079r1_rule","stigId":"V-81365","groupId":"V-81365","title":"DPMS Target WebSphere AS 9.x","severity":"CAT II","description":"Encryption is only as good as the encryption modules utilized. Unapproved cryptographic module algorithms cannot be verified and cannot be relied upon to provide confidentiality or integrity, and DoD data may be compromised due to weak algorithms. The use of TLS provides confidentiality of data in transit between the application server and client. FIPS 140-2 approved TLS versions include TLS V1.0 or greater. TLS must be enabled and non-FIPS-approved SSL versions must be disabled. NIST SP 800-52 specifies the preferred configurations for government systems. Satisfies: SRG-APP-000179-AS-000129, SRG-APP-000440-AS-000167, SRG-APP-000442-AS-000259, SRG-APP-000439-AS-000155, SRG-APP-000224-AS-000152, SRG-APP-000514-AS-000136, SRG-APP-000416-AS-000140","fixText":"From administrative console, click Security >> SSL certificate and key management >> Manage FIPS.\r\n\r\nCheck \"Enable FIPS 140-2\".\r\n\r\nClick \"Save\".\r\n\r\nSynchronize with the nodes.\r\n\r\nRestart all the JVMs.","checkText":"From administrative console, click Security >> SSL certificate and key management >> Manage FIPS.\r\n\r\nIf \"Enable FIPS 140-2\" is not selected, this is a finding.","cciIds":["CCI-000803","CCI-001188","CCI-002418","CCI-002421","CCI-002422","CCI-002450"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-96081r1_rule","stigId":"V-81367","groupId":"V-81367","title":"DPMS Target WebSphere AS 9.x","severity":"CAT II","description":"Personal Identity Verification (PIV) credentials are those credentials issued by federal agencies that conform to FIPS Publication 201 and supporting guidance documents. OMB Memorandum 11-11 requires federal agencies to continue implementing the requirements specified in HSPD-12 to enable agency-wide use of PIV credentials. PIV credentials are only used in an unclassified environment. Access may be denied to authorized users if federal agency PIV credentials are not accepted to access the management interface.","fixText":"From the admin console, select System Administration >> Deployment Manager >> Java and Process Management >> Process definition >> Java Virtual Machine >> Custom Properties.\r\n\r\nSelect \"New\".\r\n\r\nInsert the following case sensitive value into the \"Name\" field: \"adminconsole.certLogin\"\r\n\r\nSelect \"Value\".\r\n\r\nEnter \"true\".\r\n\r\nClick \"Apply\".\r\n\r\nClick \"Save\".\r\n\r\nSelect Security >> SSL Certificate and Key management >> SSL Configurations >> Select CellDefaultSSLSettings >> Quality of Protection (QOP) settings.\r\n\r\nIn the \"Client Authentication\" drop box, make sure \"Supported\" or \"Required\" is selected. \r\n\r\nClick \"Apply\".\r\n\r\nClick \"Save\".\r\n\r\nSave a backup copy and edit the Web.xml file as follows: <WAS_INSTALL>/profiles/<profileName>/config/cells/<cellName>/applications/isclite.ear/deployments/isclite/isclite.war/WEB-INF/web.xml:\r\n--- Change: \r\n< security-constraint>\r\n<web-resource-collection>\r\n<web-resource-name>Protected Area</web-resource-name>\r\n<url-pattern>/</url-pattern>\r\n--- So it becomes:\r\n< security-constraint>\r\n<web-resource-collection>\r\n<web-resource-name>Protected Area</web-resource-name>\r\n<url-pattern>/</url-pattern>\r\n<url-pattern>/logon.jsp</url-pattern>\r\n<url-pattern>/logonError.jsp</url-pattern>\r\n--- Add these security constraints if not already present:\r\n<security-constraint>\r\n<web-resource-collection>\r\n<web-resource-name>free pages</web-resource-name>\r\n<url-pattern>/*.jsp</url-pattern>\r\n<url-pattern>/css/*</url-pattern>\r\n<url-pattern>/images/*</url-pattern>\r\n<url-pattern>/j_security_check</url-pattern>\r\n</web-resource-collection>\r\n</security-constraint> \r\n--- Change:\r\n<auth-method>FORM</auth-method>\r\nto\r\n<auth-method>CLIENT-CERT</auth-method>\r\n\r\nSave the \"web.xml\" file.\r\n\r\nStop and restart the Deployment Manager. \r\n\r\nLog on to the admin console using your certificate.","checkText":"Check that the admin console is enabled for client certificate logon.\r\n\r\nIn the Deployment Manager, check the file on: <WAS_INSTALL>/profiles/<profileName>/config/cells/<cellName>/applications/isclite.ear/deployments/isclite/isclite.war/WEB-INF/web.xml.\r\n\r\nIf the XML element \"<auth-method>FORM</auth-method>\" is present, this is a finding.","cciIds":["CCI-002009"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-96083r1_rule","stigId":"V-81369","groupId":"V-81369","title":"DPMS Target WebSphere AS 9.x","severity":"CAT II","description":"Class 3 PKI certificates are used for servers and software signing rather than for identifying individuals. Class 4 certificates are used for business-to-business transactions. Utilizing unapproved certificates not issued or approved by DoD or CNS creates an integrity risk. The application server must utilize approved DoD or CNS Class 3 or Class 4 certificates for software signing and business-to-business transactions.","fixText":"Utilize DoD certificates that have been issued by a DoD PKI CA.\r\n\r\nTo replace a non-DoD PKI-established certificate:\r\nFrom the administrative console, navigate to Security >> SSL Certificates and Key Management >> KeyStores and Certificates.\r\n\r\nFor each keystore that requires the change:\r\nImport a new certificate by clicking \"Import\".\r\n\r\nClick \"keystore\" file.\r\n\r\nEnter the location of the new certificate.\r\n\r\nSpecify the type of keystore and keystore password.\r\n\r\nSpecify alias information.\r\n\r\nClick \"Apply\". \r\n\r\nAfter the certificate is imported, click on \"Replace\" to replace the original certificate with the new certificate.","checkText":"From administrative console, navigate to Security >> SSL Certificates and Key Management >> KeyStores and Certificates.\r\n\r\nFor each keystore, click on \"Signer Certificates\".\r\n\r\nIf any of the certificates are not issued by an approved DoD CA, this is a finding.","cciIds":["CCI-002450"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-96085r1_rule","stigId":"V-81371","groupId":"V-81371","title":"DPMS Target WebSphere AS 9.x","severity":"CAT II","description":"The application server consists of the management interface and hosted applications. By separating the management interface from hosted applications, the user must authenticate as a privileged user to the management interface before being presented with management functionality. This prevents non-privileged users from having visibility to functions not available to the user. By limiting visibility, a compromised non-privileged account does not offer information to the attacker to functionality and information needed to further the attack on the application server. Application server management functionality includes functions necessary to administer the application server and requires privileged access via one of the accounts assigned to a management role. The hosted application and hosted application functionality consists of the assets needed for the application to function, such as the business logic, databases, user authentication, etc. The separation of application server administration functionality from hosted application functionality is either physical or logical and is accomplished by using different computers, different central processing units, different instances of the operating system, network addresses, network ports, or combinations of these methods, as appropriate.","fixText":"If any application server host is installed in the DMZ, reassign IP address to a secured network and reconfigure the application server.","checkText":"Review System Security Plan and system architecture documentation.\r\n\r\nInterview the system administrator.\r\n\r\nIdentify any DMZ networks.\r\n\r\nIf there are no DMZ networks in the application server's architecture, this requirement is NA.\r\n\r\nIn the administrative console, click Servers >> Server Types >> WebSphere application servers.\r\n\r\nFor each application server, review the \"hostname\" field and determine if the application server has a DMZ network IP address. \r\n\r\nIf any application server is hosted in the DMZ network, this is a finding.","cciIds":["CCI-001082"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-96087r1_rule","stigId":"V-81373","groupId":"V-81373","title":"DPMS Target WebSphere AS 9.x","severity":"CAT II","description":"This control focuses on communications protection at the session, versus packet level. At the application layer, session IDs are tokens generated by web applications to uniquely identify an application user's session. Web applications utilize session tokens or session IDs in order to establish application user identity. Proper use of session IDs addresses man-in-the-middle attacks, including session hijacking or insertion of false information into a session. Application servers must provide the capability to perform mutual authentication. Mutual authentication is when both the client and the server authenticate each other.","fixText":"Navigate to Security >> SSL certificate and key management >> Keystore and certificates.\r\n\r\nClick on the trust store used to store the signers of the administrators' certificates. (The default is cellDefaultTrustStore). \r\n\r\nClick on \"Signer Certificates\".\r\n\r\nClick \"Add\".\r\n\r\nFollow the instructions to import the signer from a file.\r\n\r\nClick \"OK\".","checkText":"Review System Security Plan documentation for location of the trust store used to store the signers of the administrators certificates. By default this is \"cellDefaultTrustStore\".\r\n\r\nNavigate to Security >> SSL certificate and key management >> Keystore and certificates.\r\n\r\nClick on the trust store used to store the signers of the administrators' certificates (root CA). (The default is cellDefaultTrustStore).\r\n\r\nClick on \"Signer Certificates\".\r\n\r\nIf there are no DoD signer certificates, this is a finding.","cciIds":["CCI-001184"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-96089r1_rule","stigId":"V-81375","groupId":"V-81375","title":"DPMS Target WebSphere AS 9.x","severity":"CAT II","description":"Untrusted Certificate Authorities (CA) can issue certificates, but they may be issued by organizations or individuals that seek to compromise DoD systems or by organizations with insufficient security controls. If the CA used for verifying the certificate is not a DoD-approved CA, trust of this CA has not been established. The DoD will only accept PKI certificates obtained from a DoD-approved internal or external certificate authority. Reliance on CAs for the establishment of secure sessions includes, for example, the use of SSL/TLS certificates. The application server must only allow the use of DoD PKI-established certificate authorities for verification.","fixText":"Utilize DoD certificates that have been issued by an approved DoD PKI CA.\r\n\r\nTo replace a non-DoD PKI-established certificate:\r\nFrom the administrative console, navigate to Security >> SSL Certificates and Key Management >> KeyStores and Certificates.\r\n\r\nFor each keystores that requires the change:\r\nImport a new certificate by clicking \"Import\".\r\n\r\nClick \"keystore\" file.\r\n\r\nEnter the location of the new certificate.\r\n\r\nSpecify the type of keystore and keystore password.\r\n\r\nSpecify alias information.\r\n\r\nClick \"Apply\".\r\n\r\nAfter the certificate is imported, click on \"Replace\" to replace the original certificate with the new certificate.","checkText":"Review System Security Plan documentation for a list of DoD-approved CAs. \r\n\r\nFrom administrative console, navigate to Security >> SSL Certificates and Key Management >> KeyStores and Certificates.\r\n\r\nFor each keystore, click on \"Personal Certificates\".\r\n\r\nIf any of the certificates are not issued by an approved DoD CA, this is a finding.","cciIds":["CCI-002470"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-96091r1_rule","stigId":"V-81377","groupId":"V-81377","title":"DPMS Target WebSphere AS 9.x","severity":"CAT III","description":"Failure to a known secure state helps prevent a loss of confidentiality, integrity, or availability in the event of a failure of the information system or a component of the system. When an application is deployed to the application server, if the deployment process does not complete properly and without errors, there is the potential that some application files may not be deployed or may be corrupted and an application error may occur during runtime. The application server must be able to perform complete application deployments. A partial deployment can leave the server in an inconsistent state. Application servers may provide a transaction rollback function to address this issue.","fixText":"From the administration console, select WebSphere application server clusters.\r\n\r\nSelect each cluster name.\r\n\r\nSelect cluster members >> Details.\r\n\r\nSet all cluster members configured weight to a non-zero value.","checkText":"Review System Security Plan documentation to determine if the server is configured to use A/B clusters.\r\n\r\nIf the System Security Plan does not specify utilizing A/B clusters, the requirement is NA.\r\n\r\nFrom the administration console, select WebSphere application server clusters.\r\n\r\nSelect each cluster name.\r\n\r\nSelect cluster members.\r\n\r\nIf the weight of any cluster member is \"0\", this is a finding.","cciIds":["CCI-001190"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-96093r1_rule","stigId":"V-81379","groupId":"V-81379","title":"DPMS Target WebSphere AS 9.x","severity":"CAT III","description":"This requirement is dependent upon system MAC and confidentiality. If the system MAC and confidentiality levels do not specify redundancy requirements, this requirement is NA. Failure to a known secure state helps prevent a loss of confidentiality, integrity, or availability in the event of a failure of the information system or a component of the system. When application failure is encountered, preserving application state facilitates application restart and return to the operational mode of the organization with less disruption of mission/business processes. Clustering of multiple application servers is a common approach to providing fail-safe application availability when system MAC and confidentiality levels require redundancy. Satisfies: SRG-APP-000225-AS-000154, SRG-APP-000435-AS-000069","fixText":"In the administrative console, click Servers >> Clusters >> WebSphere application server clusters >> New.\r\n\r\nSpecify a name for the cluster.\r\n\r\nClick \"Next\".\r\n\r\nSpecify the name of the first cluster member.\r\n\r\nSelect the node on which you want this cluster member to reside, leave remaining fields as default.\r\n\r\nClick \"Next\".\r\n\r\nCreate additional cluster members as needed (give unique name for each member and click \"Add Member\"), when finished adding members click \"Next\".\r\n\r\nClick \"Finish\" to create the cluster.\r\n\r\nClick \"Save\".\r\n\r\nRefer to vendor documentation that provides direction on the creation of clusters for specific details.\r\n\r\nRestart DMGR and sync all JVMs.","checkText":"Review Systems Security Plan and identify system categorization.\r\n\r\nIf the system is not categorized as HIGH, this requirement is NA.\r\n\r\nIn the administrative console, click Servers >> Clusters >> WebSphere application server clusters.\r\n\r\nEnsure you have a cluster defined, if not this is a finding.","cciIds":["CCI-001190","CCI-002385"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-96095r1_rule","stigId":"V-81381","groupId":"V-81381","title":"DPMS Target WebSphere AS 9.x","severity":"CAT III","description":"Automated LTPA key generation can create unplanned outages. Plan to change your LTPA keys during a scheduled outage. Distribute the new keys to all nodes in the cell and to all external systems/cells during this outage window.","fixText":"Navigate to Security >> SSL Certificate and Key Management >> Key set groups >> Cell LTPAKeySetGroup.\r\n\r\nUncheck automatically generate keys.\r\n\r\nClick \"OK\".\r\n\r\nClick \"Save\".\r\n\r\nRestart the \"Deployment Manager\".","checkText":"If LTPA is not utilized, this is not applicable.\r\n\r\nRequest the documented process to manually regenerate the LTPA keys.\r\n\r\nThe time period for regeneration must be defined, documented, and accepted by the ISSO but must be performed at least annually.\r\n\r\nNavigate to Security >> SSL Certificate and Key Management >> Key set groups >> Cell LTPAKeySetGroup.\r\n\r\nIf automatically generate keys is checked, this is a finding.","cciIds":["CCI-002475"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-96097r1_rule","stigId":"V-81383","groupId":"V-81383","title":"DPMS Target WebSphere AS 9.x","severity":"CAT III","description":"The encryption of authentication information that is exchanged between servers involves the Lightweight Third-Party Authentication (LTPA) mechanism. LTPA utilizes encryption keys, if LTPA is utilized, the LTPA keys must be regenerated on a regular basis. The time period must be defined, documented and accepted by the ISSO but must be performed at least annually. Note: If LTPA keys are shared across cells, you must export the keys from the cell where the keys have been regenerated, and import into the cells whose keys have not changed. Instructions for managing the LTPA keys is provided here: https://www.ibm.com/support/knowledgecenter/en/SSAW57_9.0.0/com.ibm.websphere.nd.multiplatform.doc/ae/tsec_sslmanagelptakeys.html","fixText":"These steps must be documented and then executed during the down time scheduled for periodic LTPA key regeneration.\r\n\r\nThe time period must be defined, documented and accepted by the ISSO but must be performed at least annually.\r\n\r\nNavigate to Security >> SSL Certificate and Key Management >> Key set groups.\r\n\r\nCheck \"CellLTPAKeySetGroup\".\r\n\r\nClick \"Generate Keys\".\r\n\r\nClick \"Save\".\r\n\r\nThen synchronize the changes to all nodes.","checkText":"If LTPA is not utilized, this is not applicable.\r\n\r\nRequest the documented process to manually regenerate the LTPA keys.\r\n\r\nThe time period for regeneration must be defined, documented and accepted by the ISSO but must be performed at least annually. \r\n\r\nReview documented process for LTPA key regeneration.\r\n\r\nIf there is no process to regenerate LTPA keys periodically, this is a finding.","cciIds":["CCI-002475"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-96099r1_rule","stigId":"V-81385","groupId":"V-81385","title":"DPMS Target WebSphere AS 9.x","severity":"CAT II","description":"DoS is a condition when a resource is not available for legitimate users. When this occurs, the organization either cannot accomplish its mission or must operate at degraded capacity. To reduce the possibility or effect of a DoS, the application server must employ defined security safeguards. These safeguards will be determined by the placement of the application server and the type of applications being hosted within the application server framework. There are many examples of technologies that exist to limit or, in some cases, eliminate the effects of DoS attacks (e.g., limiting processes or restricting the number of sessions the application opens at one time). Employing increased capacity and bandwidth, combined with service redundancy or clustering, may reduce the susceptibility to some DoS attacks.","fixText":"To create a cluster, navigate to Servers >> Clusters >> WebSphere Application Server Clusters >> New and follow the wizard.\r\n\r\nAfter cluster creation, re-install your application to the cluster.\r\n\r\nRefer to product documentation for specific details on how to create and manage WebSphere clusters.","checkText":"Review Systems Security Plan and identify system categorization.\r\n\r\nIf the system is not categorized as HIGH, this requirement is NA.\r\n\r\nIdentify HA applications installed on the server.\r\n\r\nVerify applications defined as requiring HA protections are running on a cluster. \r\n\r\nFrom the admin console, navigate to Application >> All Applications >> [application name] >> Target specific application status.\r\n\r\nIf the target application has been designated as an HA application but is not running on a cluster, this is a finding.","cciIds":["CCI-002385"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-96101r1_rule","stigId":"V-81387","groupId":"V-81387","title":"DPMS Target WebSphere AS 9.x","severity":"CAT III","description":"DoS is a condition when a resource is not available for legitimate users. When this occurs, the organization either cannot accomplish its mission or must operate at degraded capacity. To reduce the possibility or effect of a DoS, the application server must employ defined security safeguards. These safeguards will be determined by the placement of the application server and the type of applications being hosted within the application server framework. There are many examples of technologies that exist to limit or, in some cases, eliminate the effects of DoS attacks (e.g., limiting processes or restricting the number of sessions the application opens at one time). Employing increased capacity and bandwidth, combined with service redundancy or clustering, may reduce the susceptibility to some DoS attacks.","fixText":"From the admin console navigate to Servers >> all servers >> [web application server] >> Session management.\r\n\r\nFor every [web application server], set the \"Maximum in-memory session count\", \"allow overflow\", and \"session timeout\" values according to your organizational requirements.","checkText":"Review System Security Plan documentation.\r\n\r\nIdentify the application load requirements defined by system owner.\r\n\r\nRegular application user session timeout values are defined at the DoD level at 20 minutes.\r\n\r\nAn ISSO risk acceptance is required to deviate from that value.\r\n\r\nIf session timeout values are not set to \"20\" and an ISSO risk acceptance is provided, this is not a finding.\r\n\r\nFrom the admin console, navigate to Servers >> all servers >> [web application server] >> Session management.\r\n\r\nFor every [web application server], verify maximum in-memory session count.\r\n\r\nVerify \"allow overflow\" and \"session timeout\" are set according to application load requirements.\r\n\r\nIf they are not set according to application load requirements, this is a finding.","cciIds":["CCI-002385"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-96103r1_rule","stigId":"V-81389","groupId":"V-81389","title":"DPMS Target WebSphere AS 9.x","severity":"CAT II","description":"A thread pool enables components of the application server to reuse threads, which eliminates the need to create new threads at run time. Creating new threads expends system resources and can possibly lead to a DoS. Perform loading for your application to determine the required thread pool sizes.","fixText":"Perform loading for your application to determine the required thread pool sizes.\r\n\r\nTo set thread pool size: \r\nFrom the admin console >> Servers >> all servers >> [server name] >> Additional Properties >> Select Thread Pools.\r\n\r\nSet the thread pool size for each threadpool.","checkText":"Review System Security Plan documentation.\r\n\r\nIdentify the application thread pool size requirements defined by system owner. \r\n\r\nFrom the admin console navigate to Servers >> all servers >> [server name] >> ThreadPools.\r\n\r\nVerify thread pool size according to specifications in documentation.\r\n\r\nIf the maximum size for each threadpool is set too large, and not set according to application requirements, this is a finding.","cciIds":["CCI-002385"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-96105r1_rule","stigId":"V-81391","groupId":"V-81391","title":"DPMS Target WebSphere AS 9.x","severity":"CAT II","description":"Export grade encryption suites are not strong and do not meet DoD requirements. The encryption for the session becomes easy for the attacker to break. Do not use export grade encryption. Information on disabling export ciphers can be found in Knowledge Center at this link: http://www.ibm.com/support/knowledgecenter/SS7K4U_8.5.5/com.ibm.websphere.ihs.doc/ihs/rihs_ciphspec.html","fixText":"From the administrative console, navigate to Security >> SSL certificate and key management >> SSL configurations >> [Name] >> for each SSL configuration\r\n\r\nSelect \"Quality of protection (QoP) settings\" under \"Cipher suite\" settings.\r\n\r\nIdentify any ciphers that include \"EXPORT\" in their name.\r\n\r\nRemove the cipher by selecting the cipher.\r\n\r\nClick \"Remove\" button.\r\n\r\nClick \"OK\".\r\n\r\nRecycle the DMGR and sync the JVMs.","checkText":"From the administrative console, navigate to Security >> SSL certificate and key management >> SSL configurations >> [Name] >> for each SSL Configuration\r\n\r\nSelect \"Quality of protection (QoP) settings\".\r\n\r\nUnder \"Cipher suite\" settings, if any of the ciphers contained in the \"Selected ciphers\" box\" contain \"EXPORT\" in their name, this is a finding.","cciIds":["CCI-002418"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-96107r1_rule","stigId":"V-81393","groupId":"V-81393","title":"DPMS Target WebSphere AS 9.x","severity":"CAT II","description":"A Core Group (HA Domain) is a component of the high availability manager function. It can contain stand-alone servers, cluster members, node agents, administrative agents, and the deployment manager. Core groups rely on DCS, which uses a reliable multicast message (RMM) system for transport. RMM can use one of several wire transport technologies. Depending on your environment, sensitive information might be transmitted over DCS. For example, data in DynaCache and the security subject cache are transmitted using DCS. To ensure this, select a transport type of channel framework and DCS-Secure as channel chain for each core group. Be aware that DCS always authenticates messages when global security is enabled. Once the transport is encrypted, you then have a highly secure channel. Once you have done this, all services that rely on DCS are now using an encrypted and authenticated transport. Those services are DynaCache, memory-to-memory session replication, core groups, Web services caching, and stateful session bean persistence.","fixText":"From the admin console navigate to Core groups >> for every Core Group listed.\r\n\r\nSelect the [Core Group Name].\r\n\r\nUnder \"Transport\" type, select \"CHANNEL_FRAMEWORK\" button.\r\n\r\nIn the \"Transport chain\" drop down box set to \"DCS-SECURE\".\r\n\r\nClick \"Save\".\r\n\r\nSync the configuration.","checkText":"From the admin console navigate to Servers >> Core groups.\r\n\r\nFor every Core Group listed, select the Core Group [CoreGroup Name]. \r\n\r\nUnder \"Transport Type\", select the \"Channel Framework\" button.\r\n\r\nIf the \"transport chain\" drop down box is not set to \"DCS-Secure\", this is a finding.","cciIds":["CCI-002420"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-96109r1_rule","stigId":"V-81395","groupId":"V-81395","title":"DPMS Target WebSphere AS 9.x","severity":"CAT II","description":"The Web server plug-in transmits information from the Web server to the Web container over HTTP by default. Extra steps must be taken to protect the traffic from the Web server to the Web container. To force the use of HTTPS for all traffic from the plug-in, disable the HTTP transport from the Web container on every application server and then regenerate and deploy the plug-in. WCInboundDefault and the HttpQueueInboundDefault transport chains must be disabled. At which time the plug-in can only use HTTPS and so it will use it for all traffic regardless of how the traffic arrived at the Web container.","fixText":"From the admin console, navigate to Servers >> Server Types >> WebSphere Application Servers >> select each server (server name) >> Web Container Settings >> Web container transport chains. \r\n\r\nSelect the \"WCInboundDefault\" and the \"HttpQueueInboundDefault\" transport chains and disable them.\r\n\r\nClick \"Apply\".\r\n\r\nClick \"Save\".\r\n\r\nRestart the DMGR and resynch the JVMs.","checkText":"From the admin console, navigate to Servers >> Server Types >> WebSphere Application Servers >> select each server (server name) >> Web Container Settings >> Web container transport chains. \r\n\r\nVerify both \"WCInboundDefault\" and the \"HttpQueueInboundDefault\" transport chains are disabled.\r\n\r\nIf they are not disabled, this is a finding.","cciIds":["CCI-002421"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-96111r1_rule","stigId":"V-81397","groupId":"V-81397","title":"DPMS Target WebSphere AS 9.x","severity":"CAT II","description":"By default, when updating WebSphere application server, the older version of binaries are saved in case a \"roll back\" is necessary. Not keeping the older version makes it more difficult for attackers to \"revert\" back to the older version.","fixText":"Review System Security Plan and system documentation to locate the \"IBM InstallationManager\" folder.\r\n\r\nDefault locations are:\r\nUNIX:\r\n/opt/InstallationManager\r\n\r\nWindows:\r\nC:\\Program Files\\InstallationManager\r\n\r\nUNIX:\r\n<IMHOME>/eclipse/tools/imcl -c\r\n\r\nSelect \"P\" preferences. \r\nSelect \"3\" Files for rollback.\r\nEnter \"1\" to deselect.\r\nEnter \"A\" for apply.\r\nEnter \"R\" to return to Main Menu.\r\n\r\nWindows:\r\n<IMHOME>\\eclipse\\tools\\imcl.exe -c\r\n\r\nSelect \"P\" preferences.\r\nSelect \"3\" Files for rollback.\r\nEnter \"1\" to deselect.\r\nEnter \"A\" for apply.\r\nEnter \"R\" to return to Main Menu.","checkText":"Review System Security Plan and system documentation to locate the \"IBM InstallationManager\" folder.\r\n\r\nDefault locations are:\r\nUNIX:\r\n/opt/InstallationManager\r\n\r\nWindows:\r\nC:\\Program Files\\InstallationManager\r\n\r\nUNIX:\r\n<IMHOME>/eclipse/tools/imcl -c\r\n\r\nSelect \"P\" preferences.\r\nSelect \"3\" Files for rollback.\r\n\r\nWindows:\r\n<IMHOME>\\eclipse\\tools\\imcl.exe -c\r\n\r\nSelect \"P\" preferences.\r\nSelect \"3\" Files for rollback.\r\n\r\nIf \"Save files for rollback\" is checked, this is a finding.","cciIds":["CCI-002617"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-96113r1_rule","stigId":"V-81399","groupId":"V-81399","title":"DPMS Target WebSphere AS 9.x","severity":"CAT II","description":"Security vulnerabilities are often addressed by testing and applying the latest security patches and fix packs. Latest fixpacks can be found at: http://www-01.ibm.com/support/docview.wss?uid=swg27009661","fixText":"Obtain WebSphere product security and patch support.\r\n\r\nTest and apply the latest applicable WebSphere security fixes.","checkText":"Use the admin console to determine the WebSphere version.\r\n\r\nReview patch level and fix pack.\r\n\r\nIf the most recent patches/fix packs have not been applied, this is a finding.","cciIds":["CCI-002605"],"status":"not_reviewed","findingDetails":"","comments":""},{"id":"SV-96115r1_rule","stigId":"V-81401","groupId":"V-81401","title":"DPMS Target WebSphere AS 9.x","severity":"CAT II","description":"Security flaws with software applications are discovered daily. Vendors are constantly updating and patching their products to address newly discovered security vulnerabilities. Organizations (including any contractor to the organization) are required to promptly install security-relevant software updates (e.g., patches, service packs, and hot fixes) to production systems after thorough testing of the patches within a lab environment. Flaws discovered during security assessments, continuous monitoring, incident response activities, or information system error handling must also be addressed expeditiously.","fixText":"Sign up to receive WebSphere security bulletins at the IBM website.\r\n\r\nMonitor IAVMs, CTOs, and DTMs for update notices affecting WebSphere.\r\n\r\nObtain WebSphere product security and patch support.\r\n\r\nTest and apply the latest applicable WebSphere security fixes.","checkText":"From the admin console, click on \"welcome\".\r\n\r\nUnder Suite Name, locate \"WebSphere Application Server\".\r\n\r\nView the \"version\". \r\n\r\nAccess IBM support website: https://www.ibm.com/support\r\n\r\nIdentify the most recent patch/fix version available for the WebSphere Traditional Application Server (not the Liberty version).\r\n\r\nIf the most recent patches/fix packs have not been applied, this is a finding.","cciIds":["CCI-002605"],"status":"not_reviewed","findingDetails":"","comments":""}]}